/* automatically generated by rust-bindgen 0.55.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage, Align> {
    storage: Storage,
    align: [Align; 0],
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage, align: [] }
    }
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }

pub const TM_STATISTICS_TAB_VT_NAME: &'static [u8; 18usize] = b"tm_statistics_tab\0";
pub const TM_TASK_MANAGER_API_NAME: &'static [u8; 20usize] = b"tm_task_manager_api\0";
pub const TM_TASK_MANAGER_TAB_VT_NAME: &'static [u8; 20usize] = b"tm_task_manager_tab\0";
pub const THE_MACHINERY_VERSION: &'static [u8; 8usize] = b"2020.11\0";
pub const TM_TT_TYPE__APPLICATION_SETTINGS: &'static [u8; 24usize] = b"tm_application_settings\0";
pub const TM_TT_TYPE__WINDOW_LAYOUTS: &'static [u8; 18usize] = b"tm_window_layouts\0";
pub const TM_TT_TYPE__WINDOW_LAYOUT: &'static [u8; 17usize] = b"tm_window_layout\0";
pub const TM_TT_TYPE__RECENT_FILE: &'static [u8; 15usize] = b"tm_recent_file\0";
pub const TM_TT_TYPE__TABWELL: &'static [u8; 11usize] = b"tm_tabwell\0";
pub const TM_TT_TYPE__TAB_VIEW: &'static [u8; 12usize] = b"tm_tab_view\0";
pub const TM_TT_TYPE__PROJECT_SETTINGS: &'static [u8; 20usize] = b"tm_project_settings\0";
pub const TM_TT_TYPE__INTERFACE_SETTINGS: &'static [u8; 22usize] = b"tm_interface_settings\0";
pub const TM_TT_TYPE__PUBLISH_SETTINGS: &'static [u8; 20usize] = b"tm_publish_settings\0";
pub const TM_TREE_VIEW_TAB_VT_NAME: &'static [u8; 17usize] = b"tm_tree_view_tab\0";
pub const TM_UI_SAMPLE_TAB_VT_NAME: &'static [u8; 17usize] = b"tm_ui_sample_tab\0";
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
extern "C" {
    pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type size_t = ::std::os::raw::c_ulonglong;
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
extern "C" {
    pub fn __security_init_cookie();
}
extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize);
}
extern "C" {
    pub static mut __security_cookie: usize;
}
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_vec2_t {
    pub x: f32,
    pub y: f32,
}
#[test]
fn bindgen_test_layout_tm_vec2_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_vec2_t>(),
        8usize,
        concat!("Size of: ", stringify!(tm_vec2_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_vec2_t>(),
        4usize,
        concat!("Alignment of ", stringify!(tm_vec2_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_vec2_t>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_vec2_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_vec2_t>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_vec2_t),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_vec3_t {
    pub x: f32,
    pub y: f32,
    pub z: f32,
}
#[test]
fn bindgen_test_layout_tm_vec3_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_vec3_t>(),
        12usize,
        concat!("Size of: ", stringify!(tm_vec3_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_vec3_t>(),
        4usize,
        concat!("Alignment of ", stringify!(tm_vec3_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_vec3_t>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_vec3_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_vec3_t>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_vec3_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_vec3_t>())).z as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_vec3_t),
            "::",
            stringify!(z)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_vec4_t {
    pub x: f32,
    pub y: f32,
    pub z: f32,
    pub w: f32,
}
#[test]
fn bindgen_test_layout_tm_vec4_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_vec4_t>(),
        16usize,
        concat!("Size of: ", stringify!(tm_vec4_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_vec4_t>(),
        4usize,
        concat!("Alignment of ", stringify!(tm_vec4_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_vec4_t>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_vec4_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_vec4_t>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_vec4_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_vec4_t>())).z as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_vec4_t),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_vec4_t>())).w as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_vec4_t),
            "::",
            stringify!(w)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_mat44_t {
    pub xx: f32,
    pub xy: f32,
    pub xz: f32,
    pub xw: f32,
    pub yx: f32,
    pub yy: f32,
    pub yz: f32,
    pub yw: f32,
    pub zx: f32,
    pub zy: f32,
    pub zz: f32,
    pub zw: f32,
    pub wx: f32,
    pub wy: f32,
    pub wz: f32,
    pub ww: f32,
}
#[test]
fn bindgen_test_layout_tm_mat44_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_mat44_t>(),
        64usize,
        concat!("Size of: ", stringify!(tm_mat44_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_mat44_t>(),
        4usize,
        concat!("Alignment of ", stringify!(tm_mat44_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).xx as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(xx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).xy as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(xy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).xz as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(xz)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).xw as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(xw)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).yx as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(yx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).yy as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(yy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).yz as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(yz)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).yw as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(yw)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).zx as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(zx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).zy as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(zy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).zz as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(zz)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).zw as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(zw)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).wx as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(wx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).wy as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(wy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).wz as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(wz)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).ww as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(ww)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_transform_t {
    pub pos: tm_vec3_t,
    pub rot: tm_vec4_t,
    pub scl: tm_vec3_t,
}
#[test]
fn bindgen_test_layout_tm_transform_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_transform_t>(),
        40usize,
        concat!("Size of: ", stringify!(tm_transform_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_transform_t>(),
        4usize,
        concat!("Alignment of ", stringify!(tm_transform_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_transform_t>())).pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_transform_t),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_transform_t>())).rot as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_transform_t),
            "::",
            stringify!(rot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_transform_t>())).scl as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_transform_t),
            "::",
            stringify!(scl)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_rect_t {
    pub x: f32,
    pub y: f32,
    pub w: f32,
    pub h: f32,
}
#[test]
fn bindgen_test_layout_tm_rect_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_rect_t>(),
        16usize,
        concat!("Size of: ", stringify!(tm_rect_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_rect_t>(),
        4usize,
        concat!("Alignment of ", stringify!(tm_rect_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_rect_t>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_rect_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_rect_t>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_rect_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_rect_t>())).w as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_rect_t),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_rect_t>())).h as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_rect_t),
            "::",
            stringify!(h)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_clock_o {
    pub opaque: u64,
}
#[test]
fn bindgen_test_layout_tm_clock_o() {
    assert_eq!(
        ::std::mem::size_of::<tm_clock_o>(),
        8usize,
        concat!("Size of: ", stringify!(tm_clock_o))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_clock_o>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_clock_o))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_clock_o>())).opaque as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_clock_o),
            "::",
            stringify!(opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_uuid_t {
    pub a: u64,
    pub b: u64,
}
#[test]
fn bindgen_test_layout_tm_uuid_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_uuid_t>(),
        16usize,
        concat!("Size of: ", stringify!(tm_uuid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_uuid_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_uuid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_uuid_t>())).a as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_uuid_t),
            "::",
            stringify!(a)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_uuid_t>())).b as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_uuid_t),
            "::",
            stringify!(b)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_color_srgb_t {
    pub r: u8,
    pub g: u8,
    pub b: u8,
    pub a: u8,
}
#[test]
fn bindgen_test_layout_tm_color_srgb_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_color_srgb_t>(),
        4usize,
        concat!("Size of: ", stringify!(tm_color_srgb_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_color_srgb_t>(),
        1usize,
        concat!("Alignment of ", stringify!(tm_color_srgb_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_color_srgb_t>())).r as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_color_srgb_t),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_color_srgb_t>())).g as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_color_srgb_t),
            "::",
            stringify!(g)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_color_srgb_t>())).b as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_color_srgb_t),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_color_srgb_t>())).a as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_color_srgb_t),
            "::",
            stringify!(a)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct tm_tt_id_t {
    pub __bindgen_anon_1: tm_tt_id_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union tm_tt_id_t__bindgen_ty_1 {
    pub u64_: u64,
    pub __bindgen_anon_1: tm_tt_id_t__bindgen_ty_1__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct tm_tt_id_t__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize], u32>,
}
#[test]
fn bindgen_test_layout_tm_tt_id_t__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<tm_tt_id_t__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(tm_tt_id_t__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<tm_tt_id_t__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(tm_tt_id_t__bindgen_ty_1__bindgen_ty_1)
        )
    );
}
impl tm_tt_id_t__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn type_(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 10u8) as u64) }
    }
    #[inline]
    pub fn set_type(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 10u8, val as u64)
        }
    }
    #[inline]
    pub fn generation(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 22u8) as u64) }
    }
    #[inline]
    pub fn set_generation(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 22u8, val as u64)
        }
    }
    #[inline]
    pub fn index(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 32u8) as u64) }
    }
    #[inline]
    pub fn set_index(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 32u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: u64,
        generation: u64,
        index: u64,
    ) -> __BindgenBitfieldUnit<[u8; 8usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 10u8, {
            let type_: u64 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(10usize, 22u8, {
            let generation: u64 = unsafe { ::std::mem::transmute(generation) };
            generation as u64
        });
        __bindgen_bitfield_unit.set(32usize, 32u8, {
            let index: u64 = unsafe { ::std::mem::transmute(index) };
            index as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_tm_tt_id_t__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<tm_tt_id_t__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(tm_tt_id_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_tt_id_t__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_tt_id_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_tt_id_t__bindgen_ty_1>())).u64_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_tt_id_t__bindgen_ty_1),
            "::",
            stringify!(u64_)
        )
    );
}
#[test]
fn bindgen_test_layout_tm_tt_id_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_tt_id_t>(),
        8usize,
        concat!("Size of: ", stringify!(tm_tt_id_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_tt_id_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_tt_id_t))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_tt_undo_scope_t {
    pub u64_: u64,
}
#[test]
fn bindgen_test_layout_tm_tt_undo_scope_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_tt_undo_scope_t>(),
        8usize,
        concat!("Size of: ", stringify!(tm_tt_undo_scope_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_tt_undo_scope_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_tt_undo_scope_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_tt_undo_scope_t>())).u64_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_tt_undo_scope_t),
            "::",
            stringify!(u64_)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_allocator_o {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_allocator_i {
    pub inst: *mut tm_allocator_o,
    pub mem_scope: u32,
    pub _padding_15: [::std::os::raw::c_char; 4usize],
    pub realloc: ::std::option::Option<
        unsafe extern "C" fn(
            a: *mut tm_allocator_i,
            ptr: *mut ::std::os::raw::c_void,
            old_size: u64,
            new_size: u64,
            file: *const ::std::os::raw::c_char,
            line: u32,
        ) -> *mut ::std::os::raw::c_void,
    >,
}
#[test]
fn bindgen_test_layout_tm_allocator_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_allocator_i>(),
        24usize,
        concat!("Size of: ", stringify!(tm_allocator_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_allocator_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_allocator_i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_allocator_i>())).inst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_i),
            "::",
            stringify!(inst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_allocator_i>())).mem_scope as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_i),
            "::",
            stringify!(mem_scope)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_allocator_i>()))._padding_15 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_i),
            "::",
            stringify!(_padding_15)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_allocator_i>())).realloc as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_i),
            "::",
            stringify!(realloc)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_allocator_statistics_t {
    pub system_allocation_count: u64,
    pub system_allocated_bytes: u64,
    pub vm_reserved: u64,
    pub vm_committed: u64,
    pub system_churn_allocation_count: u64,
    pub system_churn_allocated_bytes: u64,
    pub vm_churn_committed: u64,
}
#[test]
fn bindgen_test_layout_tm_allocator_statistics_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_allocator_statistics_t>(),
        56usize,
        concat!("Size of: ", stringify!(tm_allocator_statistics_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_allocator_statistics_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_allocator_statistics_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_allocator_statistics_t>())).system_allocation_count
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_statistics_t),
            "::",
            stringify!(system_allocation_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_allocator_statistics_t>())).system_allocated_bytes as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_statistics_t),
            "::",
            stringify!(system_allocated_bytes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_allocator_statistics_t>())).vm_reserved as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_statistics_t),
            "::",
            stringify!(vm_reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_allocator_statistics_t>())).vm_committed as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_statistics_t),
            "::",
            stringify!(vm_committed)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_allocator_statistics_t>())).system_churn_allocation_count
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_statistics_t),
            "::",
            stringify!(system_churn_allocation_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_allocator_statistics_t>())).system_churn_allocated_bytes
                as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_statistics_t),
            "::",
            stringify!(system_churn_allocated_bytes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_allocator_statistics_t>())).vm_churn_committed as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_statistics_t),
            "::",
            stringify!(vm_churn_committed)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_allocator_api {
    pub system: *mut tm_allocator_i,
    pub end_of_page: *mut tm_allocator_i,
    pub vm: *mut tm_allocator_i,
    pub statistics: *mut tm_allocator_statistics_t,
    pub create_child: ::std::option::Option<
        unsafe extern "C" fn(
            parent: *const tm_allocator_i,
            desc: *const ::std::os::raw::c_char,
        ) -> tm_allocator_i,
    >,
    pub destroy_child: ::std::option::Option<unsafe extern "C" fn(child: *const tm_allocator_i)>,
    pub destroy_child_allowing_leaks: ::std::option::Option<
        unsafe extern "C" fn(child: *const tm_allocator_i, max_leaked_bytes: u64),
    >,
    pub create_leaky_root_scope: ::std::option::Option<
        unsafe extern "C" fn(
            parent: *const tm_allocator_i,
            desc: *const ::std::os::raw::c_char,
        ) -> tm_allocator_i,
    >,
    pub create_fixed_vm: ::std::option::Option<
        unsafe extern "C" fn(reserve_size: u64, mem_scope: u32) -> tm_allocator_i,
    >,
}
#[test]
fn bindgen_test_layout_tm_allocator_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_allocator_api>(),
        72usize,
        concat!("Size of: ", stringify!(tm_allocator_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_allocator_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_allocator_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_allocator_api>())).system as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_api),
            "::",
            stringify!(system)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_allocator_api>())).end_of_page as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_api),
            "::",
            stringify!(end_of_page)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_allocator_api>())).vm as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_api),
            "::",
            stringify!(vm)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_allocator_api>())).statistics as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_api),
            "::",
            stringify!(statistics)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_allocator_api>())).create_child as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_api),
            "::",
            stringify!(create_child)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_allocator_api>())).destroy_child as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_api),
            "::",
            stringify!(destroy_child)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_allocator_api>())).destroy_child_allowing_leaks as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_api),
            "::",
            stringify!(destroy_child_allowing_leaks)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_allocator_api>())).create_leaky_root_scope as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_api),
            "::",
            stringify!(create_leaky_root_scope)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_allocator_api>())).create_fixed_vm as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_api),
            "::",
            stringify!(create_fixed_vm)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_api_registry_listener_i {
    pub ud: *mut ::std::os::raw::c_void,
    pub add_implementation: ::std::option::Option<
        unsafe extern "C" fn(
            ud: *mut ::std::os::raw::c_void,
            name: *const ::std::os::raw::c_char,
            implementation: *mut ::std::os::raw::c_void,
        ),
    >,
}
#[test]
fn bindgen_test_layout_tm_api_registry_listener_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_api_registry_listener_i>(),
        16usize,
        concat!("Size of: ", stringify!(tm_api_registry_listener_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_api_registry_listener_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_api_registry_listener_i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_api_registry_listener_i>())).ud as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_api_registry_listener_i),
            "::",
            stringify!(ud)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_api_registry_listener_i>())).add_implementation as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_api_registry_listener_i),
            "::",
            stringify!(add_implementation)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_api_registry_api {
    pub set: ::std::option::Option<
        unsafe extern "C" fn(
            name: *const ::std::os::raw::c_char,
            api: *mut ::std::os::raw::c_void,
            bytes: u32,
        ),
    >,
    pub remove: ::std::option::Option<unsafe extern "C" fn(api: *mut ::std::os::raw::c_void)>,
    pub get: ::std::option::Option<
        unsafe extern "C" fn(name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_void,
    >,
    pub get_optional: ::std::option::Option<
        unsafe extern "C" fn(name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_void,
    >,
    pub add_implementation: ::std::option::Option<
        unsafe extern "C" fn(
            name: *const ::std::os::raw::c_char,
            implementation: *mut ::std::os::raw::c_void,
        ),
    >,
    pub remove_implementation: ::std::option::Option<
        unsafe extern "C" fn(
            name: *const ::std::os::raw::c_char,
            implementation: *mut ::std::os::raw::c_void,
        ),
    >,
    pub implementations: ::std::option::Option<
        unsafe extern "C" fn(
            name: *const ::std::os::raw::c_char,
            count: *mut u32,
        ) -> *mut *mut ::std::os::raw::c_void,
    >,
    pub add_listener:
        ::std::option::Option<unsafe extern "C" fn(listener: *const tm_api_registry_listener_i)>,
    pub static_variable: ::std::option::Option<
        unsafe extern "C" fn(
            id: u64,
            size: u32,
            file: *const ::std::os::raw::c_char,
            line: u32,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub log_missing_apis: ::std::option::Option<unsafe extern "C" fn()>,
}
#[test]
fn bindgen_test_layout_tm_api_registry_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_api_registry_api>(),
        80usize,
        concat!("Size of: ", stringify!(tm_api_registry_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_api_registry_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_api_registry_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_api_registry_api>())).set as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_api_registry_api),
            "::",
            stringify!(set)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_api_registry_api>())).remove as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_api_registry_api),
            "::",
            stringify!(remove)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_api_registry_api>())).get as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_api_registry_api),
            "::",
            stringify!(get)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_api_registry_api>())).get_optional as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_api_registry_api),
            "::",
            stringify!(get_optional)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_api_registry_api>())).add_implementation as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_api_registry_api),
            "::",
            stringify!(add_implementation)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_api_registry_api>())).remove_implementation as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_api_registry_api),
            "::",
            stringify!(remove_implementation)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_api_registry_api>())).implementations as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_api_registry_api),
            "::",
            stringify!(implementations)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_api_registry_api>())).add_listener as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_api_registry_api),
            "::",
            stringify!(add_listener)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_api_registry_api>())).static_variable as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_api_registry_api),
            "::",
            stringify!(static_variable)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_api_registry_api>())).log_missing_apis as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_api_registry_api),
            "::",
            stringify!(log_missing_apis)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_ui_o {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_viewer_o {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_application_o {
    _unused: [u8; 0],
}
pub type tm_application_modal_f = ::std::option::Option<
    unsafe extern "C" fn(
        data: *mut ::std::os::raw::c_void,
        ui: *mut tm_ui_o,
        rect: tm_rect_t,
        font: u32,
        font_info: *const tm_font_t,
        font_scale: f32,
        ui_has_focus: bool,
    ) -> bool,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_application_api {
    pub application: ::std::option::Option<unsafe extern "C" fn() -> *mut tm_application_o>,
    pub create: ::std::option::Option<
        unsafe extern "C" fn(
            argc: ::std::os::raw::c_int,
            argv: *mut *mut ::std::os::raw::c_char,
        ) -> *mut tm_application_o,
    >,
    pub tick: ::std::option::Option<unsafe extern "C" fn(app: *mut tm_application_o) -> bool>,
    pub destroy: ::std::option::Option<unsafe extern "C" fn(app: *mut tm_application_o)>,
    pub set_modal: ::std::option::Option<
        unsafe extern "C" fn(
            app: *mut tm_application_o,
            f: tm_application_modal_f,
            data: *mut ::std::os::raw::c_void,
        ),
    >,
    pub is_modal: ::std::option::Option<unsafe extern "C" fn(app: *const tm_application_o) -> bool>,
    pub asset_root:
        ::std::option::Option<unsafe extern "C" fn(app: *const tm_application_o) -> tm_tt_id_t>,
    pub load_core:
        ::std::option::Option<unsafe extern "C" fn(app: *const tm_application_o) -> bool>,
    pub update_core:
        ::std::option::Option<unsafe extern "C" fn(app: *const tm_application_o) -> bool>,
    pub set_cursor_hidden:
        ::std::option::Option<unsafe extern "C" fn(app: *mut tm_application_o, hidden: bool)>,
    pub exit: ::std::option::Option<unsafe extern "C" fn(app: *mut tm_application_o)>,
    pub viewer_manager: ::std::option::Option<
        unsafe extern "C" fn(app: *mut tm_application_o) -> *mut tm_viewer_manager_o,
    >,
    pub default_render_pipeline_api: ::std::option::Option<
        unsafe extern "C" fn(app: *mut tm_application_o) -> *mut tm_render_pipeline_api,
    >,
    pub ui_scale_factor: ::std::option::Option<
        unsafe extern "C" fn(app: *mut tm_application_o, ui: *mut tm_ui_o) -> f32,
    >,
}
#[test]
fn bindgen_test_layout_tm_application_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_application_api>(),
        112usize,
        concat!("Size of: ", stringify!(tm_application_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_application_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_application_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_application_api>())).application as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(application)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_application_api>())).create as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_application_api>())).tick as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(tick)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_application_api>())).destroy as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_application_api>())).set_modal as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(set_modal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_application_api>())).is_modal as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(is_modal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_application_api>())).asset_root as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(asset_root)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_application_api>())).load_core as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(load_core)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_application_api>())).update_core as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(update_core)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_application_api>())).set_cursor_hidden as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(set_cursor_hidden)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_application_api>())).exit as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(exit)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_application_api>())).viewer_manager as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(viewer_manager)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_application_api>())).default_render_pipeline_api as *const _
                as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(default_render_pipeline_api)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_application_api>())).ui_scale_factor as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(ui_scale_factor)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_the_truth_o {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_asset_database_config_t {
    pub allocator: *mut tm_allocator_i,
    pub fs: *mut tm_os_file_system_api,
    pub file_io: *mut tm_os_file_io_api,
}
#[test]
fn bindgen_test_layout_tm_asset_database_config_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_asset_database_config_t>(),
        24usize,
        concat!("Size of: ", stringify!(tm_asset_database_config_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_asset_database_config_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_asset_database_config_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_database_config_t>())).allocator as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_config_t),
            "::",
            stringify!(allocator)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_database_config_t>())).fs as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_config_t),
            "::",
            stringify!(fs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_database_config_t>())).file_io as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_config_t),
            "::",
            stringify!(file_io)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_asset_dabase_saved_item_t {
    pub uuid: tm_uuid_t,
    pub is_directory: bool,
    pub _padding_30: [::std::os::raw::c_char; 7usize],
}
#[test]
fn bindgen_test_layout_tm_asset_dabase_saved_item_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_asset_dabase_saved_item_t>(),
        24usize,
        concat!("Size of: ", stringify!(tm_asset_dabase_saved_item_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_asset_dabase_saved_item_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_asset_dabase_saved_item_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_dabase_saved_item_t>())).uuid as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_dabase_saved_item_t),
            "::",
            stringify!(uuid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_dabase_saved_item_t>())).is_directory as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_dabase_saved_item_t),
            "::",
            stringify!(is_directory)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_dabase_saved_item_t>()))._padding_30 as *const _
                as usize
        },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_dabase_saved_item_t),
            "::",
            stringify!(_padding_30)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_asset_database_o {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_asset_database_api {
    pub create: ::std::option::Option<
        unsafe extern "C" fn(
            file: *const ::std::os::raw::c_char,
            tt: *mut tm_the_truth_o,
            config: *const tm_asset_database_config_t,
        ) -> *mut tm_asset_database_o,
    >,
    pub open: ::std::option::Option<
        unsafe extern "C" fn(
            file: *const ::std::os::raw::c_char,
            tt: *mut tm_the_truth_o,
            config: *const tm_asset_database_config_t,
        ) -> *mut tm_asset_database_o,
    >,
    pub close: ::std::option::Option<unsafe extern "C" fn(db: *mut tm_asset_database_o)>,
    pub save_modified: ::std::option::Option<
        unsafe extern "C" fn(db: *mut tm_asset_database_o, asset_root: tm_tt_id_t),
    >,
    pub save_modified_except: ::std::option::Option<
        unsafe extern "C" fn(
            db: *mut tm_asset_database_o,
            asset_root: tm_tt_id_t,
            ignore: *mut tm_tt_id_t,
            num_ignore: u32,
        ),
    >,
    pub save_asset: ::std::option::Option<
        unsafe extern "C" fn(db: *mut tm_asset_database_o, asset: tm_tt_id_t),
    >,
    pub delete_asset: ::std::option::Option<
        unsafe extern "C" fn(db: *mut tm_asset_database_o, asset: tm_tt_id_t),
    >,
    pub revert_asset: ::std::option::Option<
        unsafe extern "C" fn(
            db: *mut tm_asset_database_o,
            asset: tm_tt_id_t,
            undo_scope: tm_tt_undo_scope_t,
        ) -> bool,
    >,
    pub load:
        ::std::option::Option<unsafe extern "C" fn(db: *mut tm_asset_database_o) -> tm_tt_id_t>,
    pub saved_name: ::std::option::Option<
        unsafe extern "C" fn(
            db: *mut tm_asset_database_o,
            item: tm_uuid_t,
        ) -> *const ::std::os::raw::c_char,
    >,
    pub saved_directory: ::std::option::Option<
        unsafe extern "C" fn(db: *mut tm_asset_database_o, item: tm_uuid_t) -> tm_uuid_t,
    >,
    pub saved_version: ::std::option::Option<
        unsafe extern "C" fn(db: *mut tm_asset_database_o, asset: tm_uuid_t) -> u64,
    >,
    pub all_saved_items: ::std::option::Option<
        unsafe extern "C" fn(
            db: *mut tm_asset_database_o,
            ta: *mut tm_temp_allocator_i,
        ) -> *mut tm_asset_dabase_saved_item_t,
    >,
}
#[test]
fn bindgen_test_layout_tm_asset_database_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_asset_database_api>(),
        104usize,
        concat!("Size of: ", stringify!(tm_asset_database_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_asset_database_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_asset_database_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_database_api>())).create as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_api),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_database_api>())).open as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_api),
            "::",
            stringify!(open)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_database_api>())).close as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_api),
            "::",
            stringify!(close)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_database_api>())).save_modified as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_api),
            "::",
            stringify!(save_modified)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_database_api>())).save_modified_except as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_api),
            "::",
            stringify!(save_modified_except)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_database_api>())).save_asset as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_api),
            "::",
            stringify!(save_asset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_database_api>())).delete_asset as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_api),
            "::",
            stringify!(delete_asset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_database_api>())).revert_asset as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_api),
            "::",
            stringify!(revert_asset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_database_api>())).load as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_api),
            "::",
            stringify!(load)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_database_api>())).saved_name as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_api),
            "::",
            stringify!(saved_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_database_api>())).saved_directory as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_api),
            "::",
            stringify!(saved_directory)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_database_api>())).saved_version as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_api),
            "::",
            stringify!(saved_version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_database_api>())).all_saved_items as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_api),
            "::",
            stringify!(all_saved_items)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct tm_asset_io_import {
    pub allocator: *mut tm_allocator_i,
    pub tt: *mut tm_the_truth_o,
    pub reimport_into: tm_tt_id_t,
    pub target_dir: tm_tt_id_t,
    pub asset_root: tm_tt_id_t,
    pub ui: *mut tm_ui_o,
    pub asset_browser: tm_tt_id_t,
    pub asset_browser_version_at_start: u64,
    pub undo_scope: tm_tt_undo_scope_t,
}
#[test]
fn bindgen_test_layout_tm_asset_io_import() {
    assert_eq!(
        ::std::mem::size_of::<tm_asset_io_import>(),
        72usize,
        concat!("Size of: ", stringify!(tm_asset_io_import))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_asset_io_import>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_asset_io_import))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_import>())).allocator as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_import),
            "::",
            stringify!(allocator)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_import>())).tt as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_import),
            "::",
            stringify!(tt)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_io_import>())).reimport_into as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_import),
            "::",
            stringify!(reimport_into)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_import>())).target_dir as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_import),
            "::",
            stringify!(target_dir)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_import>())).asset_root as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_import),
            "::",
            stringify!(asset_root)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_import>())).ui as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_import),
            "::",
            stringify!(ui)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_io_import>())).asset_browser as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_import),
            "::",
            stringify!(asset_browser)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_io_import>())).asset_browser_version_at_start
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_import),
            "::",
            stringify!(asset_browser_version_at_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_import>())).undo_scope as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_import),
            "::",
            stringify!(undo_scope)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_asset_io_i {
    pub inst: *mut tm_asset_io_o,
    pub enabled: ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_asset_io_o) -> bool>,
    pub can_import: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_asset_io_o,
            extension: *const ::std::os::raw::c_char,
        ) -> bool,
    >,
    pub can_reimport: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_asset_io_o,
            tt: *mut tm_the_truth_o,
            asset: tm_tt_id_t,
        ) -> bool,
    >,
    pub importer_extensions_string: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_asset_io_o,
            output: *mut *mut ::std::os::raw::c_char,
            ta: *mut tm_temp_allocator_i,
            separator: *const ::std::os::raw::c_char,
        ),
    >,
    pub importer_description_string: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_asset_io_o,
            output: *mut *mut ::std::os::raw::c_char,
            ta: *mut tm_temp_allocator_i,
            separator: *const ::std::os::raw::c_char,
        ),
    >,
    pub import_asset: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_asset_io_o,
            file: *const ::std::os::raw::c_char,
            import: *const tm_asset_io_import,
        ) -> u64,
    >,
    pub can_export: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_asset_io_o,
            tt: *mut tm_the_truth_o,
            asset: tm_tt_id_t,
        ) -> bool,
    >,
    pub exporter_extension: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_asset_io_o,
            tt: *mut tm_the_truth_o,
            asset: tm_tt_id_t,
        ) -> *const ::std::os::raw::c_char,
    >,
    pub export_asset: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_asset_io_o,
            file: *const ::std::os::raw::c_char,
            tt: *mut tm_the_truth_o,
            asset_root: tm_tt_id_t,
            asset: tm_tt_id_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_tm_asset_io_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_asset_io_i>(),
        80usize,
        concat!("Size of: ", stringify!(tm_asset_io_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_asset_io_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_asset_io_i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_i>())).inst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_i),
            "::",
            stringify!(inst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_i>())).enabled as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_i),
            "::",
            stringify!(enabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_i>())).can_import as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_i),
            "::",
            stringify!(can_import)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_i>())).can_reimport as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_i),
            "::",
            stringify!(can_reimport)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_io_i>())).importer_extensions_string as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_i),
            "::",
            stringify!(importer_extensions_string)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_io_i>())).importer_description_string as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_i),
            "::",
            stringify!(importer_description_string)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_i>())).import_asset as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_i),
            "::",
            stringify!(import_asset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_i>())).can_export as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_i),
            "::",
            stringify!(can_export)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_io_i>())).exporter_extension as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_i),
            "::",
            stringify!(exporter_extension)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_i>())).export_asset as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_i),
            "::",
            stringify!(export_asset)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_asset_io_api {
    pub add_asset_io: ::std::option::Option<unsafe extern "C" fn(loader: *mut tm_asset_io_i)>,
    pub remove_asset_io: ::std::option::Option<unsafe extern "C" fn(loader: *mut tm_asset_io_i)>,
    pub importer: ::std::option::Option<
        unsafe extern "C" fn(extension: *const ::std::os::raw::c_char) -> *mut tm_asset_io_i,
    >,
    pub reimporter: ::std::option::Option<
        unsafe extern "C" fn(tt: *mut tm_the_truth_o, asset: tm_tt_id_t) -> *mut tm_asset_io_i,
    >,
    pub exporter: ::std::option::Option<
        unsafe extern "C" fn(tt: *mut tm_the_truth_o, asset: tm_tt_id_t) -> *mut tm_asset_io_i,
    >,
    pub io_interfaces:
        ::std::option::Option<unsafe extern "C" fn(interfaces: *mut *mut tm_asset_io_i) -> u32>,
}
#[test]
fn bindgen_test_layout_tm_asset_io_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_asset_io_api>(),
        48usize,
        concat!("Size of: ", stringify!(tm_asset_io_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_asset_io_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_asset_io_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_api>())).add_asset_io as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_api),
            "::",
            stringify!(add_asset_io)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_api>())).remove_asset_io as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_api),
            "::",
            stringify!(remove_asset_io)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_api>())).importer as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_api),
            "::",
            stringify!(importer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_api>())).reimporter as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_api),
            "::",
            stringify!(reimporter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_api>())).exporter as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_api),
            "::",
            stringify!(exporter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_api>())).io_interfaces as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_api),
            "::",
            stringify!(io_interfaces)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_base_64_api {
    pub encoded_size: ::std::option::Option<unsafe extern "C" fn(raw_size: u64) -> u64>,
    pub encode: ::std::option::Option<
        unsafe extern "C" fn(
            encoded: *mut ::std::os::raw::c_char,
            raw: *const u8,
            raw_size: u64,
        ) -> u64,
    >,
    pub decoded_size: ::std::option::Option<
        unsafe extern "C" fn(encoded: *const ::std::os::raw::c_char, encoded_size: u64) -> u64,
    >,
    pub decode: ::std::option::Option<
        unsafe extern "C" fn(
            raw: *mut u8,
            encoded: *const ::std::os::raw::c_char,
            encoded_size: u64,
        ) -> u64,
    >,
}
#[test]
fn bindgen_test_layout_tm_base_64_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_base_64_api>(),
        32usize,
        concat!("Size of: ", stringify!(tm_base_64_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_base_64_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_base_64_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_base_64_api>())).encoded_size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_base_64_api),
            "::",
            stringify!(encoded_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_base_64_api>())).encode as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_base_64_api),
            "::",
            stringify!(encode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_base_64_api>())).decoded_size as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_base_64_api),
            "::",
            stringify!(decoded_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_base_64_api>())).decode as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_base_64_api),
            "::",
            stringify!(decode)
        )
    );
}
pub const tm_bounding_volume_type_TM_BOUNDING_VOLUME_TYPE_SPHERE: tm_bounding_volume_type = 0;
pub const tm_bounding_volume_type_TM_BOUNDING_VOLUME_TYPE_BOX: tm_bounding_volume_type = 1;
pub type tm_bounding_volume_type = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_bounding_volume_sphere_t {
    pub visibility_mask: u64,
    pub culling_disabled: bool,
    pub _padding_16: [::std::os::raw::c_char; 3usize],
    pub position: tm_vec3_t,
    pub radius: f32,
    pub _padding_19: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout_tm_bounding_volume_sphere_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_bounding_volume_sphere_t>(),
        32usize,
        concat!("Size of: ", stringify!(tm_bounding_volume_sphere_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_bounding_volume_sphere_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_bounding_volume_sphere_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_bounding_volume_sphere_t>())).visibility_mask as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_bounding_volume_sphere_t),
            "::",
            stringify!(visibility_mask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_bounding_volume_sphere_t>())).culling_disabled as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_bounding_volume_sphere_t),
            "::",
            stringify!(culling_disabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_bounding_volume_sphere_t>()))._padding_16 as *const _ as usize
        },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_bounding_volume_sphere_t),
            "::",
            stringify!(_padding_16)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_bounding_volume_sphere_t>())).position as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_bounding_volume_sphere_t),
            "::",
            stringify!(position)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_bounding_volume_sphere_t>())).radius as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_bounding_volume_sphere_t),
            "::",
            stringify!(radius)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_bounding_volume_sphere_t>()))._padding_19 as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_bounding_volume_sphere_t),
            "::",
            stringify!(_padding_19)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_bounding_volume_box_t {
    pub visibility_mask: u64,
    pub culling_disabled: bool,
    pub _padding_26: [::std::os::raw::c_char; 3usize],
    pub tm: tm_mat44_t,
    pub min: tm_vec3_t,
    pub max: tm_vec3_t,
    pub _padding_30: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout_tm_bounding_volume_box_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_bounding_volume_box_t>(),
        104usize,
        concat!("Size of: ", stringify!(tm_bounding_volume_box_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_bounding_volume_box_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_bounding_volume_box_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_bounding_volume_box_t>())).visibility_mask as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_bounding_volume_box_t),
            "::",
            stringify!(visibility_mask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_bounding_volume_box_t>())).culling_disabled as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_bounding_volume_box_t),
            "::",
            stringify!(culling_disabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_bounding_volume_box_t>()))._padding_26 as *const _ as usize
        },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_bounding_volume_box_t),
            "::",
            stringify!(_padding_26)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_bounding_volume_box_t>())).tm as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_bounding_volume_box_t),
            "::",
            stringify!(tm)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_bounding_volume_box_t>())).min as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_bounding_volume_box_t),
            "::",
            stringify!(min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_bounding_volume_box_t>())).max as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_bounding_volume_box_t),
            "::",
            stringify!(max)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_bounding_volume_box_t>()))._padding_30 as *const _ as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_bounding_volume_box_t),
            "::",
            stringify!(_padding_30)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_buddy_allocator_raw_api {
    pub init:
        ::std::option::Option<unsafe extern "C" fn(buffer: *mut u8, size: u32, block_size: u32)>,
    pub realloc: ::std::option::Option<
        unsafe extern "C" fn(
            buffer: *mut u8,
            ptr: *mut ::std::os::raw::c_void,
            old_size: u64,
            new_size: u64,
        ) -> *mut ::std::os::raw::c_void,
    >,
}
#[test]
fn bindgen_test_layout_tm_buddy_allocator_raw_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_buddy_allocator_raw_api>(),
        16usize,
        concat!("Size of: ", stringify!(tm_buddy_allocator_raw_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_buddy_allocator_raw_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_buddy_allocator_raw_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buddy_allocator_raw_api>())).init as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buddy_allocator_raw_api),
            "::",
            stringify!(init)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_buddy_allocator_raw_api>())).realloc as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buddy_allocator_raw_api),
            "::",
            stringify!(realloc)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_buddy_allocator_api {
    pub create: ::std::option::Option<
        unsafe extern "C" fn(
            backing: *mut tm_allocator_i,
            initial_size: u32,
            block_size: u32,
        ) -> *mut tm_allocator_i,
    >,
    pub destroy: ::std::option::Option<unsafe extern "C" fn(a: *mut tm_allocator_i)>,
}
#[test]
fn bindgen_test_layout_tm_buddy_allocator_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_buddy_allocator_api>(),
        16usize,
        concat!("Size of: ", stringify!(tm_buddy_allocator_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_buddy_allocator_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_buddy_allocator_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buddy_allocator_api>())).create as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buddy_allocator_api),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buddy_allocator_api>())).destroy as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buddy_allocator_api),
            "::",
            stringify!(destroy)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_buffers_o {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_buffers_i {
    pub inst: *mut tm_buffers_o,
    pub allocate: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_buffers_o,
            size: u64,
            initialize: *const ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub add: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_buffers_o,
            data: *const ::std::os::raw::c_void,
            size: u64,
            hash: u64,
        ) -> u32,
    >,
    pub retain: ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_buffers_o, id: u32)>,
    pub release: ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_buffers_o, id: u32)>,
    pub get: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *const tm_buffers_o,
            id: u32,
            size: *mut u64,
        ) -> *const ::std::os::raw::c_void,
    >,
    pub size:
        ::std::option::Option<unsafe extern "C" fn(inst: *const tm_buffers_o, id: u32) -> u64>,
    pub hash:
        ::std::option::Option<unsafe extern "C" fn(inst: *const tm_buffers_o, id: u32) -> u64>,
    pub lookup:
        ::std::option::Option<unsafe extern "C" fn(inst: *const tm_buffers_o, hash: u64) -> u32>,
    pub debug__refcount:
        ::std::option::Option<unsafe extern "C" fn(inst: *const tm_buffers_o, id: u32) -> u32>,
}
#[test]
fn bindgen_test_layout_tm_buffers_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_buffers_i>(),
        80usize,
        concat!("Size of: ", stringify!(tm_buffers_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_buffers_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_buffers_i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buffers_i>())).inst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_i),
            "::",
            stringify!(inst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buffers_i>())).allocate as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_i),
            "::",
            stringify!(allocate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buffers_i>())).add as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_i),
            "::",
            stringify!(add)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buffers_i>())).retain as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_i),
            "::",
            stringify!(retain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buffers_i>())).release as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_i),
            "::",
            stringify!(release)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buffers_i>())).get as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_i),
            "::",
            stringify!(get)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buffers_i>())).size as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_i),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buffers_i>())).hash as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_i),
            "::",
            stringify!(hash)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buffers_i>())).lookup as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_i),
            "::",
            stringify!(lookup)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buffers_i>())).debug__refcount as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_i),
            "::",
            stringify!(debug__refcount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_streamable_buffers_i {
    pub __bindgen_padding_0: [u64; 10usize],
    pub map: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_buffers_o,
            path: *const ::std::os::raw::c_char,
            offset: u64,
            size: u64,
            hash: u64,
        ) -> u32,
    >,
    pub map_database: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_buffers_o,
            hash: u64,
            size: u64,
            file: *const tm_file_o,
            page_size: u32,
            page_header_size: u32,
            first_page: u32,
        ) -> u32,
    >,
    pub is_mapped:
        ::std::option::Option<unsafe extern "C" fn(inst: *const tm_buffers_o, id: u32) -> bool>,
    pub is_loaded:
        ::std::option::Option<unsafe extern "C" fn(inst: *const tm_buffers_o, id: u32) -> bool>,
    pub unload: ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_buffers_o, id: u32)>,
    pub save: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_buffers_o,
            id: u32,
            path: *const ::std::os::raw::c_char,
            offset: u64,
        ),
    >,
    pub background_load_all: ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_buffers_o)>,
    pub ensure_all_loaded: ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_buffers_o)>,
    pub set_io: ::std::option::Option<
        unsafe extern "C" fn(inst: *mut tm_buffers_o, io: *mut tm_os_file_io_api),
    >,
}
#[test]
fn bindgen_test_layout_tm_streamable_buffers_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_streamable_buffers_i>(),
        152usize,
        concat!("Size of: ", stringify!(tm_streamable_buffers_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_streamable_buffers_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_streamable_buffers_i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_streamable_buffers_i>())).map as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_streamable_buffers_i),
            "::",
            stringify!(map)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_streamable_buffers_i>())).map_database as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_streamable_buffers_i),
            "::",
            stringify!(map_database)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_streamable_buffers_i>())).is_mapped as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_streamable_buffers_i),
            "::",
            stringify!(is_mapped)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_streamable_buffers_i>())).is_loaded as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_streamable_buffers_i),
            "::",
            stringify!(is_loaded)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_streamable_buffers_i>())).unload as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_streamable_buffers_i),
            "::",
            stringify!(unload)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_streamable_buffers_i>())).save as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_streamable_buffers_i),
            "::",
            stringify!(save)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_streamable_buffers_i>())).background_load_all as *const _
                as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_streamable_buffers_i),
            "::",
            stringify!(background_load_all)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_streamable_buffers_i>())).ensure_all_loaded as *const _
                as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_streamable_buffers_i),
            "::",
            stringify!(ensure_all_loaded)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_streamable_buffers_i>())).set_io as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_streamable_buffers_i),
            "::",
            stringify!(set_io)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_buffers_api {
    pub create:
        ::std::option::Option<unsafe extern "C" fn(a: *mut tm_allocator_i) -> *mut tm_buffers_i>,
    pub destroy: ::std::option::Option<unsafe extern "C" fn(i: *mut tm_buffers_i)>,
    pub create_streamable: ::std::option::Option<
        unsafe extern "C" fn(
            a: *mut tm_allocator_i,
            io: *mut tm_os_file_io_api,
        ) -> *mut tm_streamable_buffers_i,
    >,
    pub destroy_streamable:
        ::std::option::Option<unsafe extern "C" fn(i: *mut tm_streamable_buffers_i)>,
}
#[test]
fn bindgen_test_layout_tm_buffers_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_buffers_api>(),
        32usize,
        concat!("Size of: ", stringify!(tm_buffers_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_buffers_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_buffers_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buffers_api>())).create as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_api),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buffers_api>())).destroy as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_api),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_buffers_api>())).create_streamable as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_api),
            "::",
            stringify!(create_streamable)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_buffers_api>())).destroy_streamable as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_api),
            "::",
            stringify!(destroy_streamable)
        )
    );
}
pub const tm_buffer_component_type_TM_BUFFER_COMPONENT_TYPE_FLOAT: tm_buffer_component_type = 0;
pub const tm_buffer_component_type_TM_BUFFER_COMPONENT_TYPE_NORMALIZED_INTEGER:
    tm_buffer_component_type = 1;
pub const tm_buffer_component_type_TM_BUFFER_COMPONENT_TYPE_INTEGER: tm_buffer_component_type = 2;
pub const tm_buffer_component_type_TM_BUFFER_COMPONENT_TYPE_DEPTH_STENCIL:
    tm_buffer_component_type = 3;
pub type tm_buffer_component_type = ::std::os::raw::c_int;
pub const tm_buffer_compression_format_TM_BUFFER_COMPRESSION_FORMAT_BC1_RGB:
    tm_buffer_compression_format = 0;
pub const tm_buffer_compression_format_TM_BUFFER_COMPRESSION_FORMAT_BC1_RGBA:
    tm_buffer_compression_format = 1;
pub const tm_buffer_compression_format_TM_BUFFER_COMPRESSION_FORMAT_BC2:
    tm_buffer_compression_format = 2;
pub const tm_buffer_compression_format_TM_BUFFER_COMPRESSION_FORMAT_BC3:
    tm_buffer_compression_format = 3;
pub const tm_buffer_compression_format_TM_BUFFER_COMPRESSION_FORMAT_BC4:
    tm_buffer_compression_format = 4;
pub const tm_buffer_compression_format_TM_BUFFER_COMPRESSION_FORMAT_BC5:
    tm_buffer_compression_format = 5;
pub const tm_buffer_compression_format_TM_BUFFER_COMPRESSION_FORMAT_BC6H_U:
    tm_buffer_compression_format = 6;
pub const tm_buffer_compression_format_TM_BUFFER_COMPRESSION_FORMAT_BC6H_S:
    tm_buffer_compression_format = 7;
pub const tm_buffer_compression_format_TM_BUFFER_COMPRESSION_FORMAT_BC7:
    tm_buffer_compression_format = 8;
pub const tm_buffer_compression_format_TM_BUFFER_COMPRESSION_FORMAT_MAX_FORMATS:
    tm_buffer_compression_format = 9;
pub type tm_buffer_compression_format = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_buffer_format_api {
    pub encode_uncompressed_format: ::std::option::Option<
        unsafe extern "C" fn(
            component_type: u32,
            sign: bool,
            bits_x: u8,
            bits_y: u8,
            bits_z: u8,
            bits_w: u8,
        ) -> u32,
    >,
    pub encode_compressed_format:
        ::std::option::Option<unsafe extern "C" fn(compression_type: u32) -> u32>,
    pub is_compressed: ::std::option::Option<unsafe extern "C" fn(format: u32) -> bool>,
    pub decode_uncompressed: ::std::option::Option<
        unsafe extern "C" fn(
            format: u32,
            component_type: *mut u32,
            sign: *mut bool,
            bits_x: *mut u8,
            bits_y: *mut u8,
            bits_z: *mut u8,
            bits_w: *mut u8,
        ) -> bool,
    >,
    pub decode_compression_format: ::std::option::Option<
        unsafe extern "C" fn(format: u32, compression_format: *mut u32) -> bool,
    >,
    pub bits_per_element: ::std::option::Option<unsafe extern "C" fn(format: u32) -> u32>,
    pub num_components: ::std::option::Option<unsafe extern "C" fn(format: u32) -> u32>,
    pub human_readable: ::std::option::Option<
        unsafe extern "C" fn(
            format: u32,
            ta: *mut tm_temp_allocator_i,
        ) -> *const ::std::os::raw::c_char,
    >,
}
#[test]
fn bindgen_test_layout_tm_buffer_format_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_buffer_format_api>(),
        64usize,
        concat!("Size of: ", stringify!(tm_buffer_format_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_buffer_format_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_buffer_format_api))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_buffer_format_api>())).encode_uncompressed_format as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffer_format_api),
            "::",
            stringify!(encode_uncompressed_format)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_buffer_format_api>())).encode_compressed_format as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffer_format_api),
            "::",
            stringify!(encode_compressed_format)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_buffer_format_api>())).is_compressed as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffer_format_api),
            "::",
            stringify!(is_compressed)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_buffer_format_api>())).decode_uncompressed as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffer_format_api),
            "::",
            stringify!(decode_uncompressed)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_buffer_format_api>())).decode_compression_format as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffer_format_api),
            "::",
            stringify!(decode_compression_format)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_buffer_format_api>())).bits_per_element as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffer_format_api),
            "::",
            stringify!(bits_per_element)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_buffer_format_api>())).num_components as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffer_format_api),
            "::",
            stringify!(num_components)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_buffer_format_api>())).human_readable as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffer_format_api),
            "::",
            stringify!(human_readable)
        )
    );
}
pub const tm_camera_transform_TM_CAMERA_TRANSFORM_DEFAULT: tm_camera_transform = 0;
pub const tm_camera_transform_TM_CAMERA_TRANSFORM_EYE_LEFT: tm_camera_transform = 1;
pub const tm_camera_transform_TM_CAMERA_TRANSFORM_EYE_RIGHT: tm_camera_transform = 2;
pub const tm_camera_transform_TM_CAMERA_TRANSFORM_MAX_TRANSFORMS: tm_camera_transform = 3;
pub type tm_camera_transform = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_camera_t {
    pub projection: [tm_mat44_t; 3usize],
    pub view: [tm_mat44_t; 3usize],
    pub near_plane: f32,
    pub far_plane: f32,
    pub vertical_fov: f32,
}
#[test]
fn bindgen_test_layout_tm_camera_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_camera_t>(),
        396usize,
        concat!("Size of: ", stringify!(tm_camera_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_camera_t>(),
        4usize,
        concat!("Alignment of ", stringify!(tm_camera_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_camera_t>())).projection as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_t),
            "::",
            stringify!(projection)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_camera_t>())).view as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_t),
            "::",
            stringify!(view)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_camera_t>())).near_plane as *const _ as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_t),
            "::",
            stringify!(near_plane)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_camera_t>())).far_plane as *const _ as usize },
        388usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_t),
            "::",
            stringify!(far_plane)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_camera_t>())).vertical_fov as *const _ as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_t),
            "::",
            stringify!(vertical_fov)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_camera_api {
    pub view_from_transform: ::std::option::Option<
        unsafe extern "C" fn(view: *mut tm_mat44_t, tm: *const tm_transform_t) -> *mut tm_mat44_t,
    >,
    pub transform_from_view: ::std::option::Option<
        unsafe extern "C" fn(
            tm: *mut tm_transform_t,
            view: *const tm_mat44_t,
        ) -> *mut tm_transform_t,
    >,
    pub projection_from_frustum: ::std::option::Option<
        unsafe extern "C" fn(
            proj: *mut tm_mat44_t,
            left: f32,
            right: f32,
            bottom: f32,
            top: f32,
            near: f32,
            far: f32,
        ) -> *mut tm_mat44_t,
    >,
    pub projection_from_fov: ::std::option::Option<
        unsafe extern "C" fn(
            proj: *mut tm_mat44_t,
            near_plane: f32,
            far_plane: f32,
            vertical_fov: f32,
            aspect: f32,
        ) -> *mut tm_mat44_t,
    >,
    pub orthographic_from_frustum: ::std::option::Option<
        unsafe extern "C" fn(
            proj: *mut tm_mat44_t,
            left: f32,
            right: f32,
            bottom: f32,
            top: f32,
            near: f32,
            far: f32,
        ) -> *mut tm_mat44_t,
    >,
    pub update_free_flight: ::std::option::Option<
        unsafe extern "C" fn(tm: *mut tm_transform_t, t: tm_vec3_t, r: tm_vec2_t),
    >,
    pub update_pan: ::std::option::Option<
        unsafe extern "C" fn(
            tm: *mut tm_transform_t,
            focus_position: *mut tm_vec3_t,
            pan: tm_vec2_t,
        ),
    >,
    pub update_maya: ::std::option::Option<
        unsafe extern "C" fn(
            tm: *mut tm_transform_t,
            focus_position: tm_vec3_t,
            zoom: f32,
            rot: tm_vec2_t,
        ),
    >,
    pub world_to_screen: ::std::option::Option<
        unsafe extern "C" fn(
            camera: *const tm_camera_t,
            transform: tm_camera_transform,
            viewport: tm_rect_t,
            world: *const tm_vec3_t,
            screen: *mut tm_vec3_t,
            n: u32,
        ) -> *mut tm_vec3_t,
    >,
    pub screen_to_world: ::std::option::Option<
        unsafe extern "C" fn(
            camera: *const tm_camera_t,
            transform: tm_camera_transform,
            viewport: tm_rect_t,
            screen: *const tm_vec3_t,
            world: *mut tm_vec3_t,
            n: u32,
        ) -> *mut tm_vec3_t,
    >,
    pub meters_per_pixel: ::std::option::Option<
        unsafe extern "C" fn(distance: f32, vertical_fov: f32, viewport_height: f32) -> f32,
    >,
}
#[test]
fn bindgen_test_layout_tm_camera_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_camera_api>(),
        88usize,
        concat!("Size of: ", stringify!(tm_camera_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_camera_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_camera_api))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_camera_api>())).view_from_transform as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_api),
            "::",
            stringify!(view_from_transform)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_camera_api>())).transform_from_view as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_api),
            "::",
            stringify!(transform_from_view)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_camera_api>())).projection_from_frustum as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_api),
            "::",
            stringify!(projection_from_frustum)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_camera_api>())).projection_from_fov as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_api),
            "::",
            stringify!(projection_from_fov)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_camera_api>())).orthographic_from_frustum as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_api),
            "::",
            stringify!(orthographic_from_frustum)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_camera_api>())).update_free_flight as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_api),
            "::",
            stringify!(update_free_flight)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_camera_api>())).update_pan as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_api),
            "::",
            stringify!(update_pan)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_camera_api>())).update_maya as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_api),
            "::",
            stringify!(update_maya)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_camera_api>())).world_to_screen as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_api),
            "::",
            stringify!(world_to_screen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_camera_api>())).screen_to_world as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_api),
            "::",
            stringify!(screen_to_world)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_camera_api>())).meters_per_pixel as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_api),
            "::",
            stringify!(meters_per_pixel)
        )
    );
}
pub const tm_collaboration_status_TM_COLLABORATION_STATUS_DISCONNECTED: tm_collaboration_status = 0;
pub const tm_collaboration_status_TM_COLLABORATION_STATUS_HOST_STARTING: tm_collaboration_status =
    1;
pub const tm_collaboration_status_TM_COLLABORATION_STATUS_HOST: tm_collaboration_status = 2;
pub const tm_collaboration_status_TM_COLLABORATION_STATUS_CONNECTING: tm_collaboration_status = 3;
pub const tm_collaboration_status_TM_COLLABORATION_STATUS_CLIENT: tm_collaboration_status = 4;
pub const tm_collaboration_status_TM_COLLABORATION_STATUS_ERROR: tm_collaboration_status = 5;
pub type tm_collaboration_status = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_collaboration_config_t {
    pub tt: *mut tm_the_truth_o,
    pub ud: *mut ::std::os::raw::c_void,
    pub host_save_state: ::std::option::Option<
        unsafe extern "C" fn(
            ud: *mut ::std::os::raw::c_void,
            carray: *mut *mut ::std::os::raw::c_char,
            a: *mut tm_allocator_i,
        ),
    >,
    pub client_reset_truth: ::std::option::Option<
        unsafe extern "C" fn(ud: *mut ::std::os::raw::c_void) -> *mut tm_the_truth_o,
    >,
    pub client_decompress_state: ::std::option::Option<
        unsafe extern "C" fn(
            app_ud: *mut ::std::os::raw::c_void,
            state: *const ::std::os::raw::c_char,
            size: u64,
            allocator: *mut tm_allocator_i,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub client_buffer_hashes: ::std::option::Option<
        unsafe extern "C" fn(
            ud: *mut ::std::os::raw::c_void,
            state: *const ::std::os::raw::c_char,
            size: u64,
            count: *mut u64,
        ) -> *const u64,
    >,
    pub client_load_state: ::std::option::Option<
        unsafe extern "C" fn(
            ud: *mut ::std::os::raw::c_void,
            state: *const ::std::os::raw::c_char,
            size: u64,
        ) -> bool,
    >,
    pub cache_dir: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_tm_collaboration_config_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_collaboration_config_t>(),
        64usize,
        concat!("Size of: ", stringify!(tm_collaboration_config_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_collaboration_config_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_collaboration_config_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_config_t>())).tt as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_config_t),
            "::",
            stringify!(tt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_config_t>())).ud as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_config_t),
            "::",
            stringify!(ud)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_config_t>())).host_save_state as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_config_t),
            "::",
            stringify!(host_save_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_config_t>())).client_reset_truth as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_config_t),
            "::",
            stringify!(client_reset_truth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_config_t>())).client_decompress_state
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_config_t),
            "::",
            stringify!(client_decompress_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_config_t>())).client_buffer_hashes as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_config_t),
            "::",
            stringify!(client_buffer_hashes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_config_t>())).client_load_state as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_config_t),
            "::",
            stringify!(client_load_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_config_t>())).cache_dir as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_config_t),
            "::",
            stringify!(cache_dir)
        )
    );
}
pub const tm_collaboration_session_type_TM_COLLABORATION_SESSION_TYPE_NONE:
    tm_collaboration_session_type = 0;
pub const tm_collaboration_session_type_TM_COLLABORATION_SESSION_TYPE_HOST:
    tm_collaboration_session_type = 1;
pub const tm_collaboration_session_type_TM_COLLABORATION_SESSION_TYPE_CLIENT:
    tm_collaboration_session_type = 2;
pub type tm_collaboration_session_type = ::std::os::raw::c_int;
pub const tm_collaboration_session_status_TM_COLLABORATION_SESSION_STATUS_DISCONNECTED:
    tm_collaboration_session_status = 0;
pub const tm_collaboration_session_status_TM_COLLABORATION_SESSION_STATUS_CONNECTING:
    tm_collaboration_session_status = 1;
pub const tm_collaboration_session_status_TM_COLLABORATION_SESSION_STATUS_CONNECTED:
    tm_collaboration_session_status = 2;
pub const tm_collaboration_session_status_TM_COLLABORATION_SESSION_STATUS_ERROR:
    tm_collaboration_session_status = 3;
pub type tm_collaboration_session_status = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_collaboration_session_o {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_collaboration_session_i {
    pub inst: *mut tm_collaboration_session_o,
    pub destroy: ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_collaboration_session_o)>,
    pub architecture:
        ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_collaboration_session_o) -> u64>,
    pub host_id:
        ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_collaboration_session_o) -> u64>,
    pub get_client_request: ::std::option::Option<
        unsafe extern "C" fn(inst: *mut tm_collaboration_session_o, client_id: *mut u64) -> bool,
    >,
    pub accept_client: ::std::option::Option<
        unsafe extern "C" fn(inst: *mut tm_collaboration_session_o, client_id: u64),
    >,
    pub send: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_collaboration_session_o,
            client_id: u64,
            buf: *const u8,
            size: u64,
        ),
    >,
    pub flush: ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_collaboration_session_o)>,
    pub update: ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_collaboration_session_o)>,
    pub get_package_data: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_collaboration_session_o,
            client_id: u64,
            data: *mut u8,
            size: *mut u64,
        ) -> bool,
    >,
    pub close_client: ::std::option::Option<
        unsafe extern "C" fn(inst: *mut tm_collaboration_session_o, client_id: u64),
    >,
    pub send_ping: ::std::option::Option<
        unsafe extern "C" fn(inst: *mut tm_collaboration_session_o, client_id: u64),
    >,
    pub type_: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_collaboration_session_o,
        ) -> tm_collaboration_session_type,
    >,
    pub status: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_collaboration_session_o,
        ) -> tm_collaboration_session_status,
    >,
    pub is_client_alive: ::std::option::Option<
        unsafe extern "C" fn(inst: *mut tm_collaboration_session_o, client_id: u64) -> bool,
    >,
    pub receive_progress: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *const tm_collaboration_session_o,
            bytes: *mut u64,
            total: *mut u64,
        ) -> bool,
    >,
    pub status_message: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_collaboration_session_o,
            buf: *mut ::std::os::raw::c_char,
            max_size: u32,
        ),
    >,
}
#[test]
fn bindgen_test_layout_tm_collaboration_session_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_collaboration_session_i>(),
        136usize,
        concat!("Size of: ", stringify!(tm_collaboration_session_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_collaboration_session_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_collaboration_session_i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_session_i>())).inst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(inst)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).destroy as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).architecture as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(architecture)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).host_id as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(host_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).get_client_request as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(get_client_request)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).accept_client as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(accept_client)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_session_i>())).send as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(send)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).flush as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(flush)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).update as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(update)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).get_package_data as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(get_package_data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).close_client as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(close_client)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).send_ping as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(send_ping)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).type_ as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).status as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).is_client_alive as *const _
                as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(is_client_alive)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).receive_progress as *const _
                as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(receive_progress)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).status_message as *const _
                as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(status_message)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_collaboration_o {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_collaboration_api {
    pub create: ::std::option::Option<
        unsafe extern "C" fn(
            a: *mut tm_allocator_i,
            config: *const tm_collaboration_config_t,
        ) -> *mut tm_collaboration_o,
    >,
    pub destroy: ::std::option::Option<unsafe extern "C" fn(coll: *mut tm_collaboration_o)>,
    pub status: ::std::option::Option<
        unsafe extern "C" fn(coll: *const tm_collaboration_o) -> tm_collaboration_status,
    >,
    pub is_downloading: ::std::option::Option<
        unsafe extern "C" fn(
            coll: *const tm_collaboration_o,
            bytes: *mut u64,
            total: *mut u64,
        ) -> bool,
    >,
    pub set_session: ::std::option::Option<
        unsafe extern "C" fn(
            coll: *mut tm_collaboration_o,
            session: *const tm_collaboration_session_i,
        ),
    >,
    pub session: ::std::option::Option<
        unsafe extern "C" fn(coll: *mut tm_collaboration_o) -> *mut tm_collaboration_session_i,
    >,
    pub disconnect: ::std::option::Option<unsafe extern "C" fn(coll: *mut tm_collaboration_o)>,
    pub update: ::std::option::Option<unsafe extern "C" fn(coll: *mut tm_collaboration_o)>,
    pub handle: ::std::option::Option<
        unsafe extern "C" fn(coll: *const tm_collaboration_o) -> *const ::std::os::raw::c_char,
    >,
    pub set_handle: ::std::option::Option<
        unsafe extern "C" fn(c: *mut tm_collaboration_o, handle: *mut ::std::os::raw::c_char),
    >,
    pub host_handle: ::std::option::Option<
        unsafe extern "C" fn(c: *const tm_collaboration_o) -> *const ::std::os::raw::c_char,
    >,
    pub num_clients:
        ::std::option::Option<unsafe extern "C" fn(coll: *const tm_collaboration_o) -> u32>,
    pub client_handle: ::std::option::Option<
        unsafe extern "C" fn(
            coll: *const tm_collaboration_o,
            i: u32,
        ) -> *const ::std::os::raw::c_char,
    >,
    pub all_handles: ::std::option::Option<
        unsafe extern "C" fn(
            coll: *const tm_collaboration_o,
            ta: *mut tm_temp_allocator_i,
        ) -> *mut *const ::std::os::raw::c_char,
    >,
    pub send_chat: ::std::option::Option<
        unsafe extern "C" fn(coll: *mut tm_collaboration_o, msg: *const ::std::os::raw::c_char),
    >,
    pub num_chat_messages:
        ::std::option::Option<unsafe extern "C" fn(coll: *const tm_collaboration_o) -> u32>,
    pub chat_message: ::std::option::Option<
        unsafe extern "C" fn(
            coll: *const tm_collaboration_o,
            i: u32,
            sender: *mut *const ::std::os::raw::c_char,
        ) -> *const ::std::os::raw::c_char,
    >,
    pub resynchronize_state: ::std::option::Option<
        unsafe extern "C" fn(coll: *mut tm_collaboration_o, tt: *mut tm_the_truth_o),
    >,
    pub send_test_packages: ::std::option::Option<
        unsafe extern "C" fn(coll: *mut tm_collaboration_o, size: u64, num: u32),
    >,
}
#[test]
fn bindgen_test_layout_tm_collaboration_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_collaboration_api>(),
        152usize,
        concat!("Size of: ", stringify!(tm_collaboration_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_collaboration_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_collaboration_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_api>())).create as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_api>())).destroy as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_api>())).status as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_api>())).is_downloading as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(is_downloading)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_api>())).set_session as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(set_session)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_api>())).session as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(session)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_api>())).disconnect as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(disconnect)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_api>())).update as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(update)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_api>())).handle as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_api>())).set_handle as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(set_handle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_api>())).host_handle as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(host_handle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_api>())).num_clients as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(num_clients)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_api>())).client_handle as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(client_handle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_api>())).all_handles as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(all_handles)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_api>())).send_chat as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(send_chat)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_api>())).num_chat_messages as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(num_chat_messages)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_api>())).chat_message as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(chat_message)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_api>())).resynchronize_state as *const _
                as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(resynchronize_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_api>())).send_test_packages as *const _ as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(send_test_packages)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_collaboration_p2p_o {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_collaboration_discovered_host_t {
    pub address: *const tm_socket_address_t,
    pub name: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_tm_collaboration_discovered_host_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_collaboration_discovered_host_t>(),
        16usize,
        concat!("Size of: ", stringify!(tm_collaboration_discovered_host_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_collaboration_discovered_host_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(tm_collaboration_discovered_host_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_discovered_host_t>())).address as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_discovered_host_t),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_discovered_host_t>())).name as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_discovered_host_t),
            "::",
            stringify!(name)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_collaboration_p2p_api {
    pub create: ::std::option::Option<
        unsafe extern "C" fn(
            coll: *mut tm_collaboration_o,
            allocator: *mut tm_allocator_i,
        ) -> *mut tm_collaboration_p2p_o,
    >,
    pub destroy: ::std::option::Option<unsafe extern "C" fn(coll_p2p: *mut tm_collaboration_p2p_o)>,
    pub update: ::std::option::Option<unsafe extern "C" fn(coll_p2p: *mut tm_collaboration_p2p_o)>,
    pub host: ::std::option::Option<
        unsafe extern "C" fn(coll_p2p: *mut tm_collaboration_p2p_o, port: u32, use_upnp: bool),
    >,
    pub connect: ::std::option::Option<
        unsafe extern "C" fn(
            coll_p2p: *mut tm_collaboration_p2p_o,
            address: *const tm_socket_address_t,
        ),
    >,
    pub discovered_lan_hosts: ::std::option::Option<
        unsafe extern "C" fn(
            coll_p2p: *const tm_collaboration_p2p_o,
            hosts: *mut tm_collaboration_discovered_host_t,
            max_hosts: u32,
        ) -> u32,
    >,
}
#[test]
fn bindgen_test_layout_tm_collaboration_p2p_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_collaboration_p2p_api>(),
        48usize,
        concat!("Size of: ", stringify!(tm_collaboration_p2p_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_collaboration_p2p_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_collaboration_p2p_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_p2p_api>())).create as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_p2p_api),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_p2p_api>())).destroy as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_p2p_api),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_p2p_api>())).update as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_p2p_api),
            "::",
            stringify!(update)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_p2p_api>())).host as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_p2p_api),
            "::",
            stringify!(host)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_p2p_api>())).connect as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_p2p_api),
            "::",
            stringify!(connect)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_p2p_api>())).discovered_lan_hosts as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_p2p_api),
            "::",
            stringify!(discovered_lan_hosts)
        )
    );
}
pub const tm_config_type_TM_CONFIG_TYPE_NULL: tm_config_type = 0;
pub const tm_config_type_TM_CONFIG_TYPE_FALSE: tm_config_type = 1;
pub const tm_config_type_TM_CONFIG_TYPE_TRUE: tm_config_type = 2;
pub const tm_config_type_TM_CONFIG_TYPE_NUMBER: tm_config_type = 3;
pub const tm_config_type_TM_CONFIG_TYPE_STRING: tm_config_type = 4;
pub const tm_config_type_TM_CONFIG_TYPE_ARRAY: tm_config_type = 5;
pub const tm_config_type_TM_CONFIG_TYPE_OBJECT: tm_config_type = 6;
pub type tm_config_type = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct tm_config_item_t {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
}
#[test]
fn bindgen_test_layout_tm_config_item_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_config_item_t>(),
        4usize,
        concat!("Size of: ", stringify!(tm_config_item_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_config_item_t>(),
        4usize,
        concat!("Alignment of ", stringify!(tm_config_item_t))
    );
}
impl tm_config_item_t {
    #[inline]
    pub fn type_(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn offset(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 29u8) as u32) }
    }
    #[inline]
    pub fn set_offset(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 29u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(type_: u32, offset: u32) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 3u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(3usize, 29u8, {
            let offset: u32 = unsafe { ::std::mem::transmute(offset) };
            offset as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_config_o {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_config_i {
    pub inst: *mut tm_config_o,
    pub root:
        ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_config_o) -> tm_config_item_t>,
    pub to_number: ::std::option::Option<
        unsafe extern "C" fn(inst: *mut tm_config_o, item: tm_config_item_t) -> f64,
    >,
    pub to_string: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_config_o,
            item: tm_config_item_t,
        ) -> *const ::std::os::raw::c_char,
    >,
    pub to_array: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_config_o,
            item: tm_config_item_t,
            items: *mut *mut tm_config_item_t,
        ) -> u32,
    >,
    pub to_object: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_config_o,
            item: tm_config_item_t,
            keys: *mut *mut tm_config_item_t,
            values: *mut *mut tm_config_item_t,
        ) -> u32,
    >,
    pub add_number: ::std::option::Option<
        unsafe extern "C" fn(inst: *mut tm_config_o, n: f64) -> tm_config_item_t,
    >,
    pub add_string: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_config_o,
            s: *const ::std::os::raw::c_char,
        ) -> tm_config_item_t,
    >,
    pub add_array: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_config_o,
            items: *const tm_config_item_t,
            size: u32,
        ) -> tm_config_item_t,
    >,
    pub add_object: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_config_o,
            keys: *const tm_config_item_t,
            values: *const tm_config_item_t,
            size: u32,
        ) -> tm_config_item_t,
    >,
    pub add_object_with_string_keys: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_config_o,
            keys: *mut *const ::std::os::raw::c_char,
            values: *const tm_config_item_t,
            size: u32,
        ) -> tm_config_item_t,
    >,
    pub array_set: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_config_o,
            array: tm_config_item_t,
            i: u32,
            item: tm_config_item_t,
        ),
    >,
    pub array_push: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_config_o,
            array: tm_config_item_t,
            item: tm_config_item_t,
        ),
    >,
    pub object_get: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_config_o,
            object: tm_config_item_t,
            key_hash: u64,
        ) -> tm_config_item_t,
    >,
    pub object_update: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_config_o,
            object: tm_config_item_t,
            key_hash: u64,
            value: tm_config_item_t,
        ),
    >,
    pub object_add: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_config_o,
            object: tm_config_item_t,
            key: *const ::std::os::raw::c_char,
            value: tm_config_item_t,
        ),
    >,
    pub set_root:
        ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_config_o, root: tm_config_item_t)>,
    pub copy:
        ::std::option::Option<unsafe extern "C" fn(dst: *mut tm_config_o, src: *mut tm_config_o)>,
    pub allocator:
        ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_config_o) -> *mut tm_allocator_i>,
}
#[test]
fn bindgen_test_layout_tm_config_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_config_i>(),
        152usize,
        concat!("Size of: ", stringify!(tm_config_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_config_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_config_i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).inst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(inst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).root as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(root)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).to_number as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(to_number)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).to_string as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(to_string)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).to_array as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(to_array)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).to_object as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(to_object)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).add_number as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(add_number)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).add_string as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(add_string)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).add_array as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(add_array)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).add_object as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(add_object)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_config_i>())).add_object_with_string_keys as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(add_object_with_string_keys)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).array_set as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(array_set)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).array_push as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(array_push)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).object_get as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(object_get)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).object_update as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(object_update)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).object_add as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(object_add)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).set_root as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(set_root)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).copy as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(copy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).allocator as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(allocator)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_config_api {
    pub create:
        ::std::option::Option<unsafe extern "C" fn(a: *mut tm_allocator_i) -> *mut tm_config_i>,
    pub destroy: ::std::option::Option<unsafe extern "C" fn(cdi: *mut tm_config_i)>,
    pub c_null: tm_config_item_t,
    pub c_false: tm_config_item_t,
    pub c_true: tm_config_item_t,
    pub _padding_153: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout_tm_config_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_config_api>(),
        32usize,
        concat!("Size of: ", stringify!(tm_config_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_config_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_config_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_api>())).create as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_api),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_api>())).destroy as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_api),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_api>())).c_null as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_api),
            "::",
            stringify!(c_null)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_api>())).c_false as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_api),
            "::",
            stringify!(c_false)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_api>())).c_true as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_api),
            "::",
            stringify!(c_true)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_api>()))._padding_153 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_api),
            "::",
            stringify!(_padding_153)
        )
    );
}
pub const tm_core_create_policy_TM_CORE_CREATE_POLICY__CREATE: tm_core_create_policy = 0;
pub const tm_core_create_policy_TM_CORE_CREATE_POLICY__REMOVE: tm_core_create_policy = 1;
pub const tm_core_create_policy_TM_CORE_CREATE_POLICY__IGNORE: tm_core_create_policy = 2;
pub type tm_core_create_policy = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_core_asset_i {
    pub core_id: u64,
    pub path: *const ::std::os::raw::c_char,
    pub create_policy: tm_core_create_policy,
    pub _padding_60: [::std::os::raw::c_char; 4usize],
    pub version: u64,
    pub user_data: *const ::std::os::raw::c_void,
    pub create: ::std::option::Option<
        unsafe extern "C" fn(
            tt: *mut tm_the_truth_o,
            user_data: *const ::std::os::raw::c_void,
        ) -> tm_tt_id_t,
    >,
    pub update: ::std::option::Option<
        unsafe extern "C" fn(
            tt: *mut tm_the_truth_o,
            data_id: tm_tt_id_t,
            old_version: u64,
            user_data: *const ::std::os::raw::c_void,
        ),
    >,
}
#[test]
fn bindgen_test_layout_tm_core_asset_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_core_asset_i>(),
        56usize,
        concat!("Size of: ", stringify!(tm_core_asset_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_core_asset_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_core_asset_i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_asset_i>())).core_id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_asset_i),
            "::",
            stringify!(core_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_asset_i>())).path as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_asset_i),
            "::",
            stringify!(path)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_asset_i>())).create_policy as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_asset_i),
            "::",
            stringify!(create_policy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_asset_i>()))._padding_60 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_asset_i),
            "::",
            stringify!(_padding_60)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_asset_i>())).version as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_asset_i),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_asset_i>())).user_data as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_asset_i),
            "::",
            stringify!(user_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_asset_i>())).create as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_asset_i),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_asset_i>())).update as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_asset_i),
            "::",
            stringify!(update)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_core_update_result_t {
    pub created_assets: *mut tm_tt_id_t,
    pub removed_assets: *mut tm_tt_id_t,
    pub updated_assets: *mut tm_tt_id_t,
}
#[test]
fn bindgen_test_layout_tm_core_update_result_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_core_update_result_t>(),
        24usize,
        concat!("Size of: ", stringify!(tm_core_update_result_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_core_update_result_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_core_update_result_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_core_update_result_t>())).created_assets as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_update_result_t),
            "::",
            stringify!(created_assets)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_core_update_result_t>())).removed_assets as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_update_result_t),
            "::",
            stringify!(removed_assets)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_core_update_result_t>())).updated_assets as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_update_result_t),
            "::",
            stringify!(updated_assets)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_core_api {
    pub create: ::std::option::Option<
        unsafe extern "C" fn(tt: *mut tm_the_truth_o, asset_root_id: tm_tt_id_t),
    >,
    pub update: ::std::option::Option<
        unsafe extern "C" fn(
            tt: *mut tm_the_truth_o,
            asset_root_id: tm_tt_id_t,
            ta: *mut tm_temp_allocator_i,
        ) -> tm_core_update_result_t,
    >,
    pub locate_asset: ::std::option::Option<
        unsafe extern "C" fn(
            tt: *mut tm_the_truth_o,
            asset_root_id: tm_tt_id_t,
            core_id: u64,
        ) -> tm_tt_id_t,
    >,
}
#[test]
fn bindgen_test_layout_tm_core_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_core_api>(),
        24usize,
        concat!("Size of: ", stringify!(tm_core_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_core_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_core_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_api>())).create as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_api),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_api>())).update as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_api),
            "::",
            stringify!(update)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_api>())).locate_asset as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_api),
            "::",
            stringify!(locate_asset)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_core_importer_asset_t {
    pub id: u64,
    pub version: u64,
    pub path: *const ::std::os::raw::c_char,
    pub create_policy: u32,
    pub _padding_46: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout_tm_core_importer_asset_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_core_importer_asset_t>(),
        32usize,
        concat!("Size of: ", stringify!(tm_core_importer_asset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_core_importer_asset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_core_importer_asset_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_importer_asset_t>())).id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_importer_asset_t),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_core_importer_asset_t>())).version as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_importer_asset_t),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_importer_asset_t>())).path as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_importer_asset_t),
            "::",
            stringify!(path)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_core_importer_asset_t>())).create_policy as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_importer_asset_t),
            "::",
            stringify!(create_policy)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_core_importer_asset_t>()))._padding_46 as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_importer_asset_t),
            "::",
            stringify!(_padding_46)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_core_importer_state_o {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_core_importer_api {
    pub create: ::std::option::Option<
        unsafe extern "C" fn(
            a: *mut tm_allocator_i,
            user_tt: *mut tm_the_truth_o,
            user_asset_root: tm_tt_id_t,
            core_project_path: *const ::std::os::raw::c_char,
            output_path: *const ::std::os::raw::c_char,
        ) -> *mut tm_core_importer_state_o,
    >,
    pub destroy: ::std::option::Option<unsafe extern "C" fn(state: *mut tm_core_importer_state_o)>,
    pub register_assets: ::std::option::Option<
        unsafe extern "C" fn(
            state: *mut tm_core_importer_state_o,
            to_register: *const tm_core_importer_asset_t,
            num_to_register: u32,
        ),
    >,
}
#[test]
fn bindgen_test_layout_tm_core_importer_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_core_importer_api>(),
        24usize,
        concat!("Size of: ", stringify!(tm_core_importer_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_core_importer_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_core_importer_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_importer_api>())).create as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_importer_api),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_importer_api>())).destroy as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_importer_api),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_core_importer_api>())).register_assets as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_importer_api),
            "::",
            stringify!(register_assets)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_crash_recovery_can_recover_result_t {
    pub data: *const ::std::os::raw::c_char,
    pub data_bytes: u32,
    pub _padding_24: [::std::os::raw::c_char; 4usize],
    pub project: *const ::std::os::raw::c_char,
    pub root: *const tm_uuid_t,
}
#[test]
fn bindgen_test_layout_tm_crash_recovery_can_recover_result_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_crash_recovery_can_recover_result_t>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(tm_crash_recovery_can_recover_result_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<tm_crash_recovery_can_recover_result_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(tm_crash_recovery_can_recover_result_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_crash_recovery_can_recover_result_t>())).data as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_crash_recovery_can_recover_result_t),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_crash_recovery_can_recover_result_t>())).data_bytes
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_crash_recovery_can_recover_result_t),
            "::",
            stringify!(data_bytes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_crash_recovery_can_recover_result_t>()))._padding_24
                as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_crash_recovery_can_recover_result_t),
            "::",
            stringify!(_padding_24)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_crash_recovery_can_recover_result_t>())).project as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_crash_recovery_can_recover_result_t),
            "::",
            stringify!(project)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_crash_recovery_can_recover_result_t>())).root as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_crash_recovery_can_recover_result_t),
            "::",
            stringify!(root)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_crash_recovery_o {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_crash_recovery_api {
    pub create: ::std::option::Option<
        unsafe extern "C" fn(
            a: *mut tm_allocator_i,
            recovery_path: *const ::std::os::raw::c_char,
        ) -> *mut tm_crash_recovery_o,
    >,
    pub destroy: ::std::option::Option<unsafe extern "C" fn(cr: *mut tm_crash_recovery_o)>,
    pub start_recording: ::std::option::Option<
        unsafe extern "C" fn(
            cr: *mut tm_crash_recovery_o,
            project: *const ::std::os::raw::c_char,
            tt: *mut tm_the_truth_o,
            root: tm_tt_id_t,
        ),
    >,
    pub stop_recording: ::std::option::Option<unsafe extern "C" fn(cr: *mut tm_crash_recovery_o)>,
    pub update: ::std::option::Option<unsafe extern "C" fn(cr: *mut tm_crash_recovery_o)>,
    pub can_recover: ::std::option::Option<
        unsafe extern "C" fn(
            cr: *mut tm_crash_recovery_o,
            ta: *mut tm_temp_allocator_i,
        ) -> tm_crash_recovery_can_recover_result_t,
    >,
    pub recover: ::std::option::Option<
        unsafe extern "C" fn(
            cr: *mut tm_crash_recovery_o,
            rd: tm_crash_recovery_can_recover_result_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_tm_crash_recovery_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_crash_recovery_api>(),
        56usize,
        concat!("Size of: ", stringify!(tm_crash_recovery_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_crash_recovery_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_crash_recovery_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_crash_recovery_api>())).create as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_crash_recovery_api),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_crash_recovery_api>())).destroy as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_crash_recovery_api),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_crash_recovery_api>())).start_recording as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_crash_recovery_api),
            "::",
            stringify!(start_recording)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_crash_recovery_api>())).stop_recording as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_crash_recovery_api),
            "::",
            stringify!(stop_recording)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_crash_recovery_api>())).update as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_crash_recovery_api),
            "::",
            stringify!(update)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_crash_recovery_api>())).can_recover as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_crash_recovery_api),
            "::",
            stringify!(can_recover)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_crash_recovery_api>())).recover as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_crash_recovery_api),
            "::",
            stringify!(recover)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_error_o {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_error_i {
    pub inst: *mut tm_error_o,
    pub errorf: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_error_o,
            file: *const ::std::os::raw::c_char,
            line: u32,
            format: *const ::std::os::raw::c_char,
            ...
        ),
    >,
    pub fatal: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_error_o,
            file: *const ::std::os::raw::c_char,
            line: u32,
            format: *const ::std::os::raw::c_char,
            ...
        ),
    >,
}
#[test]
fn bindgen_test_layout_tm_error_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_error_i>(),
        24usize,
        concat!("Size of: ", stringify!(tm_error_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_error_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_error_i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_error_i>())).inst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_error_i),
            "::",
            stringify!(inst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_error_i>())).errorf as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_error_i),
            "::",
            stringify!(errorf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_error_i>())).fatal as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_error_i),
            "::",
            stringify!(fatal)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_error_api {
    pub log: *mut tm_error_i,
    pub def: *mut tm_error_i,
}
#[test]
fn bindgen_test_layout_tm_error_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_error_api>(),
        16usize,
        concat!("Size of: ", stringify!(tm_error_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_error_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_error_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_error_api>())).log as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_error_api),
            "::",
            stringify!(log)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_error_api>())).def as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_error_api),
            "::",
            stringify!(def)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_feature_flags_api {
    pub enabled: ::std::option::Option<unsafe extern "C" fn(flag: u64) -> bool>,
    pub set_enabled: ::std::option::Option<unsafe extern "C" fn(flag: u64, enabled: bool)>,
    pub all_enabled: ::std::option::Option<unsafe extern "C" fn(count: *mut u32) -> *const u64>,
}
#[test]
fn bindgen_test_layout_tm_feature_flags_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_feature_flags_api>(),
        24usize,
        concat!("Size of: ", stringify!(tm_feature_flags_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_feature_flags_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_feature_flags_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_feature_flags_api>())).enabled as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_feature_flags_api),
            "::",
            stringify!(enabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_feature_flags_api>())).set_enabled as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_feature_flags_api),
            "::",
            stringify!(set_enabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_feature_flags_api>())).all_enabled as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_feature_flags_api),
            "::",
            stringify!(all_enabled)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_git_ignore_api {
    pub match_: ::std::option::Option<
        unsafe extern "C" fn(
            patterns: *const ::std::os::raw::c_char,
            path: *const ::std::os::raw::c_char,
        ) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_tm_git_ignore_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_git_ignore_api>(),
        8usize,
        concat!("Size of: ", stringify!(tm_git_ignore_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_git_ignore_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_git_ignore_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_git_ignore_api>())).match_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_git_ignore_api),
            "::",
            stringify!(match_)
        )
    );
}
pub const tm_image_type_TM_IMAGE_TYPE_1D: tm_image_type = 0;
pub const tm_image_type_TM_IMAGE_TYPE_2D: tm_image_type = 1;
pub const tm_image_type_TM_IMAGE_TYPE_3D: tm_image_type = 2;
pub const tm_image_type_TM_IMAGE_TYPE_CUBE: tm_image_type = 3;
pub type tm_image_type = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_image_t {
    pub type_: u32,
    pub pixel_format: u32,
    pub width: u32,
    pub height: u32,
    pub depth: u32,
    pub mip_levels: u32,
    pub layers: u32,
    pub size: u32,
}
#[test]
fn bindgen_test_layout_tm_image_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_image_t>(),
        32usize,
        concat!("Size of: ", stringify!(tm_image_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_image_t>(),
        4usize,
        concat!("Alignment of ", stringify!(tm_image_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_t>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_t),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_t>())).pixel_format as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_t),
            "::",
            stringify!(pixel_format)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_t>())).width as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_t),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_t>())).height as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_t),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_t>())).depth as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_t),
            "::",
            stringify!(depth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_t>())).mip_levels as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_t),
            "::",
            stringify!(mip_levels)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_t>())).layers as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_t),
            "::",
            stringify!(layers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_t>())).size as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_t),
            "::",
            stringify!(size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_image_archive_o {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_image_archive_i {
    pub inst: *mut tm_image_archive_o,
    pub read: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_image_archive_o,
            buffer: *mut ::std::os::raw::c_void,
            offset: u64,
            size: u32,
        ) -> u32,
    >,
    pub size: ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_image_archive_o) -> u64>,
}
#[test]
fn bindgen_test_layout_tm_image_archive_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_image_archive_i>(),
        24usize,
        concat!("Size of: ", stringify!(tm_image_archive_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_image_archive_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_image_archive_i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_archive_i>())).inst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_archive_i),
            "::",
            stringify!(inst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_archive_i>())).read as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_archive_i),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_archive_i>())).size as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_archive_i),
            "::",
            stringify!(size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_image_loader_o {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_image_loader_i {
    pub inst: *mut tm_image_loader_o,
    pub extensions_string: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_image_loader_o,
            output: *mut *mut ::std::os::raw::c_char,
            ta: *mut tm_temp_allocator_i,
            separator: *const ::std::os::raw::c_char,
        ),
    >,
    pub description_string: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_image_loader_o,
            output: *mut *mut ::std::os::raw::c_char,
            ta: *mut tm_temp_allocator_i,
            separator: *const ::std::os::raw::c_char,
        ),
    >,
    pub support_from_archive: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_image_loader_o,
            image_archive: *mut tm_image_archive_i,
        ) -> bool,
    >,
    pub support_from_extension: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_image_loader_o,
            extension: *const ::std::os::raw::c_char,
        ) -> bool,
    >,
    pub load_image: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_image_loader_o,
            image_archive: *mut tm_image_archive_i,
            image: *mut tm_image_t,
            bits: *mut u8,
        ) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_tm_image_loader_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_image_loader_i>(),
        48usize,
        concat!("Size of: ", stringify!(tm_image_loader_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_image_loader_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_image_loader_i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_loader_i>())).inst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_loader_i),
            "::",
            stringify!(inst)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_image_loader_i>())).extensions_string as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_loader_i),
            "::",
            stringify!(extensions_string)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_image_loader_i>())).description_string as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_loader_i),
            "::",
            stringify!(description_string)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_image_loader_i>())).support_from_archive as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_loader_i),
            "::",
            stringify!(support_from_archive)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_image_loader_i>())).support_from_extension as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_loader_i),
            "::",
            stringify!(support_from_extension)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_loader_i>())).load_image as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_loader_i),
            "::",
            stringify!(load_image)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_image_loader_api {
    pub add_loader: ::std::option::Option<unsafe extern "C" fn(loader: *mut tm_image_loader_i)>,
    pub remove_loader: ::std::option::Option<unsafe extern "C" fn(loader: *mut tm_image_loader_i)>,
    pub loader_from_archive: ::std::option::Option<
        unsafe extern "C" fn(image_archive: *mut tm_image_archive_i) -> *mut tm_image_loader_i,
    >,
    pub loader_from_extension: ::std::option::Option<
        unsafe extern "C" fn(extension: *const ::std::os::raw::c_char) -> *mut tm_image_loader_i,
    >,
    pub loaders:
        ::std::option::Option<unsafe extern "C" fn(loaders: *mut *mut tm_image_loader_i) -> u32>,
}
#[test]
fn bindgen_test_layout_tm_image_loader_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_image_loader_api>(),
        40usize,
        concat!("Size of: ", stringify!(tm_image_loader_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_image_loader_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_image_loader_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_loader_api>())).add_loader as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_loader_api),
            "::",
            stringify!(add_loader)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_image_loader_api>())).remove_loader as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_loader_api),
            "::",
            stringify!(remove_loader)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_image_loader_api>())).loader_from_archive as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_loader_api),
            "::",
            stringify!(loader_from_archive)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_image_loader_api>())).loader_from_extension as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_loader_api),
            "::",
            stringify!(loader_from_extension)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_loader_api>())).loaders as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_loader_api),
            "::",
            stringify!(loaders)
        )
    );
}
pub const tm_input_controller_type_TM_INPUT_CONTROLLER_TYPE_NONE: tm_input_controller_type = 0;
pub const tm_input_controller_type_TM_INPUT_CONTROLLER_TYPE_KEYBOARD: tm_input_controller_type = 1;
pub const tm_input_controller_type_TM_INPUT_CONTROLLER_TYPE_MOUSE: tm_input_controller_type = 2;
pub const tm_input_controller_type_TM_INPUT_CONTROLLER_TYPE_GAMEPAD: tm_input_controller_type = 3;
pub const tm_input_controller_type_TM_INPUT_CONTROLLER_TYPE_TOUCH: tm_input_controller_type = 4;
pub const tm_input_controller_type_TM_INPUT_CONTROLLER_TYPE_PEN: tm_input_controller_type = 5;
pub const tm_input_controller_type_TM_INPUT_CONTROLLER_TYPE_OTHER: tm_input_controller_type = -1;
pub type tm_input_controller_type = ::std::os::raw::c_int;
pub const tm_input_mouse_item_TM_INPUT_MOUSE_ITEM_NONE: tm_input_mouse_item = 0;
pub const tm_input_mouse_item_TM_INPUT_MOUSE_ITEM_BUTTON_LEFT: tm_input_mouse_item = 1;
pub const tm_input_mouse_item_TM_INPUT_MOUSE_ITEM_BUTTON_RIGHT: tm_input_mouse_item = 2;
pub const tm_input_mouse_item_TM_INPUT_MOUSE_ITEM_BUTTON_MIDDLE: tm_input_mouse_item = 3;
pub const tm_input_mouse_item_TM_INPUT_MOUSE_ITEM_BUTTON_4: tm_input_mouse_item = 4;
pub const tm_input_mouse_item_TM_INPUT_MOUSE_ITEM_BUTTON_5: tm_input_mouse_item = 5;
pub const tm_input_mouse_item_TM_INPUT_MOUSE_ITEM_WHEEL: tm_input_mouse_item = 6;
pub const tm_input_mouse_item_TM_INPUT_MOUSE_ITEM_MOVE: tm_input_mouse_item = 7;
pub const tm_input_mouse_item_TM_INPUT_MOUSE_ITEM_POSITION: tm_input_mouse_item = 8;
pub const tm_input_mouse_item_TM_INPUT_MOUSE_ITEM_COUNT: tm_input_mouse_item = 9;
pub type tm_input_mouse_item = ::std::os::raw::c_int;
pub const tm_input_pen_item_TM_INPUT_PEN_ITEM_NONE: tm_input_pen_item = 0;
pub const tm_input_pen_item_TM_INPUT_PEN_ITEM_BUTTON_1: tm_input_pen_item = 1;
pub const tm_input_pen_item_TM_INPUT_PEN_ITEM_BUTTON_2: tm_input_pen_item = 2;
pub const tm_input_pen_item_TM_INPUT_PEN_ITEM_BUTTON_3: tm_input_pen_item = 3;
pub const tm_input_pen_item_TM_INPUT_PEN_ITEM_BUTTON_4: tm_input_pen_item = 4;
pub const tm_input_pen_item_TM_INPUT_PEN_ITEM_BUTTON_5: tm_input_pen_item = 5;
pub const tm_input_pen_item_TM_INPUT_PEN_ITEM_WHEEL: tm_input_pen_item = 6;
pub const tm_input_pen_item_TM_INPUT_PEN_ITEM_POSITION: tm_input_pen_item = 7;
pub const tm_input_pen_item_TM_INPUT_PEN_ITEM_PRESSURE: tm_input_pen_item = 8;
pub const tm_input_pen_item_TM_INPUT_PEN_ITEM_ROTATION: tm_input_pen_item = 9;
pub const tm_input_pen_item_TM_INPUT_PEN_ITEM_TILT: tm_input_pen_item = 10;
pub const tm_input_pen_item_TM_INPUT_PEN_ITEM_INVERTED: tm_input_pen_item = 11;
pub const tm_input_pen_item_TM_INPUT_PEN_ITEM_ERASER: tm_input_pen_item = 12;
pub const tm_input_pen_item_TM_INPUT_PEN_ITEM_COUNT: tm_input_pen_item = 13;
pub type tm_input_pen_item = ::std::os::raw::c_int;
pub const tm_input_touch_item_TM_INPUT_TOUCH_ITEM_NONE: tm_input_touch_item = 0;
pub const tm_input_touch_item_TM_INPUT_TOUCH_ITEM_TOUCH: tm_input_touch_item = 1;
pub const tm_input_touch_item_TM_INPUT_TOUCH_ITEM_POSITION: tm_input_touch_item = 2;
pub const tm_input_touch_item_TM_INPUT_TOUCH_ITEM_PRESSURE: tm_input_touch_item = 3;
pub const tm_input_touch_item_TM_INPUT_TOUCH_ITEM_ORIENTATION: tm_input_touch_item = 4;
pub const tm_input_touch_item_TM_INPUT_TOUCH_ITEM_COUNT: tm_input_touch_item = 5;
pub type tm_input_touch_item = ::std::os::raw::c_int;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NONE: tm_input_keyboard_item = 0;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_LBUTTON: tm_input_keyboard_item = 1;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_RBUTTON: tm_input_keyboard_item = 2;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_CANCEL: tm_input_keyboard_item = 3;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_MBUTTON: tm_input_keyboard_item = 4;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_XBUTTON1: tm_input_keyboard_item = 5;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_XBUTTON2: tm_input_keyboard_item = 6;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_BACKSPACE: tm_input_keyboard_item = 8;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_TAB: tm_input_keyboard_item = 9;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_CLEAR: tm_input_keyboard_item = 12;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_ENTER: tm_input_keyboard_item = 13;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_SHIFT: tm_input_keyboard_item = 16;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_CONTROL: tm_input_keyboard_item = 17;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_MENU: tm_input_keyboard_item = 18;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_PAUSE: tm_input_keyboard_item = 19;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_CAPSLOCK: tm_input_keyboard_item = 20;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_KANA: tm_input_keyboard_item = 21;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_JUNJA: tm_input_keyboard_item = 23;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_FINAL: tm_input_keyboard_item = 24;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_HANJA: tm_input_keyboard_item = 25;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_KANJI: tm_input_keyboard_item = 25;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_ESCAPE: tm_input_keyboard_item = 27;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_CONVERT: tm_input_keyboard_item = 28;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NONCONVERT: tm_input_keyboard_item = 29;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_ACCEPT: tm_input_keyboard_item = 30;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_MODECHANGE: tm_input_keyboard_item = 31;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_SPACE: tm_input_keyboard_item = 32;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_PAGEUP: tm_input_keyboard_item = 33;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_PAGEDOWN: tm_input_keyboard_item = 34;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_END: tm_input_keyboard_item = 35;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_HOME: tm_input_keyboard_item = 36;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_LEFT: tm_input_keyboard_item = 37;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_UP: tm_input_keyboard_item = 38;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_RIGHT: tm_input_keyboard_item = 39;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_DOWN: tm_input_keyboard_item = 40;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_SELECT: tm_input_keyboard_item = 41;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_PRINT: tm_input_keyboard_item = 42;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_EXECUTE: tm_input_keyboard_item = 43;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_PRINTSCREEN: tm_input_keyboard_item = 44;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_INSERT: tm_input_keyboard_item = 45;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_DELETE: tm_input_keyboard_item = 46;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_HELP: tm_input_keyboard_item = 47;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_0: tm_input_keyboard_item = 48;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_1: tm_input_keyboard_item = 49;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_2: tm_input_keyboard_item = 50;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_3: tm_input_keyboard_item = 51;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_4: tm_input_keyboard_item = 52;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_5: tm_input_keyboard_item = 53;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_6: tm_input_keyboard_item = 54;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_7: tm_input_keyboard_item = 55;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_8: tm_input_keyboard_item = 56;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_9: tm_input_keyboard_item = 57;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_A: tm_input_keyboard_item = 65;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_B: tm_input_keyboard_item = 66;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_C: tm_input_keyboard_item = 67;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_D: tm_input_keyboard_item = 68;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_E: tm_input_keyboard_item = 69;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_F: tm_input_keyboard_item = 70;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_G: tm_input_keyboard_item = 71;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_H: tm_input_keyboard_item = 72;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_I: tm_input_keyboard_item = 73;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_J: tm_input_keyboard_item = 74;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_K: tm_input_keyboard_item = 75;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_L: tm_input_keyboard_item = 76;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_M: tm_input_keyboard_item = 77;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_N: tm_input_keyboard_item = 78;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_O: tm_input_keyboard_item = 79;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_P: tm_input_keyboard_item = 80;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_Q: tm_input_keyboard_item = 81;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_R: tm_input_keyboard_item = 82;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_S: tm_input_keyboard_item = 83;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_T: tm_input_keyboard_item = 84;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_U: tm_input_keyboard_item = 85;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_V: tm_input_keyboard_item = 86;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_W: tm_input_keyboard_item = 87;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_X: tm_input_keyboard_item = 88;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_Y: tm_input_keyboard_item = 89;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_Z: tm_input_keyboard_item = 90;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_LWIN: tm_input_keyboard_item = 91;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_RWIN: tm_input_keyboard_item = 92;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_APPS: tm_input_keyboard_item = 93;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_SLEEP: tm_input_keyboard_item = 95;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NUMPAD0: tm_input_keyboard_item = 96;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NUMPAD1: tm_input_keyboard_item = 97;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NUMPAD2: tm_input_keyboard_item = 98;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NUMPAD3: tm_input_keyboard_item = 99;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NUMPAD4: tm_input_keyboard_item = 100;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NUMPAD5: tm_input_keyboard_item = 101;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NUMPAD6: tm_input_keyboard_item = 102;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NUMPAD7: tm_input_keyboard_item = 103;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NUMPAD8: tm_input_keyboard_item = 104;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NUMPAD9: tm_input_keyboard_item = 105;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NUMPADASTERISK: tm_input_keyboard_item =
    106;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NUMPADPLUS: tm_input_keyboard_item = 107;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NUMPADENTER: tm_input_keyboard_item = 108;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NUMPADMINUS: tm_input_keyboard_item = 109;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NUMPADDOT: tm_input_keyboard_item = 110;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NUMPADSLASH: tm_input_keyboard_item = 111;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_F1: tm_input_keyboard_item = 112;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_F2: tm_input_keyboard_item = 113;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_F3: tm_input_keyboard_item = 114;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_F4: tm_input_keyboard_item = 115;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_F5: tm_input_keyboard_item = 116;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_F6: tm_input_keyboard_item = 117;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_F7: tm_input_keyboard_item = 118;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_F8: tm_input_keyboard_item = 119;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_F9: tm_input_keyboard_item = 120;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_F10: tm_input_keyboard_item = 121;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_F11: tm_input_keyboard_item = 122;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_F12: tm_input_keyboard_item = 123;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_F13: tm_input_keyboard_item = 124;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_F14: tm_input_keyboard_item = 125;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_F15: tm_input_keyboard_item = 126;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_F16: tm_input_keyboard_item = 127;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_F17: tm_input_keyboard_item = 128;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_F18: tm_input_keyboard_item = 129;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_F19: tm_input_keyboard_item = 130;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_F20: tm_input_keyboard_item = 131;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_F21: tm_input_keyboard_item = 132;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_F22: tm_input_keyboard_item = 133;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_F23: tm_input_keyboard_item = 134;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_F24: tm_input_keyboard_item = 135;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NAVIGATION_VIEW: tm_input_keyboard_item =
    136;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NAVIGATION_MENU: tm_input_keyboard_item =
    137;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NAVIGATION_UP: tm_input_keyboard_item = 138;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NAVIGATION_DOWN: tm_input_keyboard_item =
    139;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NAVIGATION_LEFT: tm_input_keyboard_item =
    140;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NAVIGATION_RIGHT: tm_input_keyboard_item =
    141;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NAVIGATION_ACCEPT: tm_input_keyboard_item =
    142;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NAVIGATION_CANCEL: tm_input_keyboard_item =
    143;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NUMLOCK: tm_input_keyboard_item = 144;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_SCROLLLOCK: tm_input_keyboard_item = 145;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NUMPADEQUAL: tm_input_keyboard_item = 146;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_OEM_FJ_JISHO: tm_input_keyboard_item = 146;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_OEM_FJ_MASSHOU: tm_input_keyboard_item =
    147;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_OEM_FJ_TOUROKU: tm_input_keyboard_item =
    148;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_OEM_FJ_LOYA: tm_input_keyboard_item = 149;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_OEM_FJ_ROYA: tm_input_keyboard_item = 150;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_LEFTSHIFT: tm_input_keyboard_item = 160;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_RIGHTSHIFT: tm_input_keyboard_item = 161;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_LEFTCONTROL: tm_input_keyboard_item = 162;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_RIGHTCONTROL: tm_input_keyboard_item = 163;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_LEFTALT: tm_input_keyboard_item = 164;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_RIGHTALT: tm_input_keyboard_item = 165;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_BROWSER_BACK: tm_input_keyboard_item = 166;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_BROWSER_FORWARD: tm_input_keyboard_item =
    167;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_BROWSER_REFRESH: tm_input_keyboard_item =
    168;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_BROWSER_STOP: tm_input_keyboard_item = 169;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_BROWSER_SEARCH: tm_input_keyboard_item =
    170;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_BROWSER_FAVORITES: tm_input_keyboard_item =
    171;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_BROWSER_HOME: tm_input_keyboard_item = 172;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_VOLUME_MUTE: tm_input_keyboard_item = 173;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_VOLUME_DOWN: tm_input_keyboard_item = 174;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_VOLUME_UP: tm_input_keyboard_item = 175;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_MEDIA_NEXT_TRACK: tm_input_keyboard_item =
    176;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_MEDIA_PREV_TRACK: tm_input_keyboard_item =
    177;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_MEDIA_STOP: tm_input_keyboard_item = 178;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_MEDIA_PLAY_PAUSE: tm_input_keyboard_item =
    179;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_LAUNCH_MAIL: tm_input_keyboard_item = 180;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_LAUNCH_MEDIA_SELECT:
    tm_input_keyboard_item = 181;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_LAUNCH_APP1: tm_input_keyboard_item = 182;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_LAUNCH_APP2: tm_input_keyboard_item = 183;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_SEMICOLON: tm_input_keyboard_item = 186;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_EQUAL: tm_input_keyboard_item = 187;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_COMMA: tm_input_keyboard_item = 188;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_MINUS: tm_input_keyboard_item = 189;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_DOT: tm_input_keyboard_item = 190;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_SLASH: tm_input_keyboard_item = 191;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_GRAVE: tm_input_keyboard_item = 192;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_GAMEPAD_A: tm_input_keyboard_item = 195;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_GAMEPAD_B: tm_input_keyboard_item = 196;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_GAMEPAD_X: tm_input_keyboard_item = 197;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_GAMEPAD_Y: tm_input_keyboard_item = 198;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_GAMEPAD_RIGHT_SHOULDER:
    tm_input_keyboard_item = 199;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_GAMEPAD_LEFT_SHOULDER:
    tm_input_keyboard_item = 200;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_GAMEPAD_LEFT_TRIGGER:
    tm_input_keyboard_item = 201;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_GAMEPAD_RIGHT_TRIGGER:
    tm_input_keyboard_item = 202;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_GAMEPAD_DPAD_UP: tm_input_keyboard_item =
    203;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_GAMEPAD_DPAD_DOWN: tm_input_keyboard_item =
    204;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_GAMEPAD_DPAD_LEFT: tm_input_keyboard_item =
    205;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_GAMEPAD_DPAD_RIGHT: tm_input_keyboard_item =
    206;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_GAMEPAD_MENU: tm_input_keyboard_item = 207;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_GAMEPAD_VIEW: tm_input_keyboard_item = 208;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_GAMEPAD_LEFT_THUMBSTICK_BUTTON:
    tm_input_keyboard_item = 209;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_GAMEPAD_RIGHT_THUMBSTICK_BUTTON:
    tm_input_keyboard_item = 210;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_GAMEPAD_LEFT_THUMBSTICK_UP:
    tm_input_keyboard_item = 211;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_GAMEPAD_LEFT_THUMBSTICK_DOWN:
    tm_input_keyboard_item = 212;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_GAMEPAD_LEFT_THUMBSTICK_RIGHT:
    tm_input_keyboard_item = 213;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_GAMEPAD_LEFT_THUMBSTICK_LEFT:
    tm_input_keyboard_item = 214;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_GAMEPAD_RIGHT_THUMBSTICK_UP:
    tm_input_keyboard_item = 215;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_GAMEPAD_RIGHT_THUMBSTICK_DOWN:
    tm_input_keyboard_item = 216;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_GAMEPAD_RIGHT_THUMBSTICK_RIGHT:
    tm_input_keyboard_item = 217;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_GAMEPAD_RIGHT_THUMBSTICK_LEFT:
    tm_input_keyboard_item = 218;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_LEFTBRACE: tm_input_keyboard_item = 219;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_BACKSLASH: tm_input_keyboard_item = 220;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_RIGHTBRACE: tm_input_keyboard_item = 221;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_APOSTROPHE: tm_input_keyboard_item = 222;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_OEM_8: tm_input_keyboard_item = 223;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_OEM_AX: tm_input_keyboard_item = 225;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_OEM_102: tm_input_keyboard_item = 226;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_ICO_HELP: tm_input_keyboard_item = 227;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_ICO_00: tm_input_keyboard_item = 228;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_PROCESSKEY: tm_input_keyboard_item = 229;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_ICO_CLEAR: tm_input_keyboard_item = 230;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_PACKET: tm_input_keyboard_item = 231;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_OEM_RESET: tm_input_keyboard_item = 233;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_OEM_JUMP: tm_input_keyboard_item = 234;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_OEM_PA1: tm_input_keyboard_item = 235;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_OEM_PA2: tm_input_keyboard_item = 236;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_OEM_PA3: tm_input_keyboard_item = 237;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_OEM_WSCTRL: tm_input_keyboard_item = 238;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_OEM_CUSEL: tm_input_keyboard_item = 239;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_OEM_ATTN: tm_input_keyboard_item = 240;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_OEM_FINISH: tm_input_keyboard_item = 241;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_COPY: tm_input_keyboard_item = 242;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_OEM_AUTO: tm_input_keyboard_item = 243;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_OEM_ENLW: tm_input_keyboard_item = 244;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_OEM_BACKTAB: tm_input_keyboard_item = 245;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_ATTN: tm_input_keyboard_item = 246;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_CRSEL: tm_input_keyboard_item = 247;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_EXSEL: tm_input_keyboard_item = 248;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_EREOF: tm_input_keyboard_item = 249;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_PLAY: tm_input_keyboard_item = 250;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_ZOOM: tm_input_keyboard_item = 251;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NONAME: tm_input_keyboard_item = 252;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_PA1: tm_input_keyboard_item = 253;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_OEM_CLEAR: tm_input_keyboard_item = 254;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_HASHTILDE: tm_input_keyboard_item = 255;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_102ND: tm_input_keyboard_item = 256;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_COMPOSE: tm_input_keyboard_item = 257;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_POWER: tm_input_keyboard_item = 258;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_OPEN: tm_input_keyboard_item = 259;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_PROPS: tm_input_keyboard_item = 260;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_FRONT: tm_input_keyboard_item = 261;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_STOP: tm_input_keyboard_item = 262;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_AGAIN: tm_input_keyboard_item = 263;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_UNDO: tm_input_keyboard_item = 264;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_CUT: tm_input_keyboard_item = 265;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_PASTE: tm_input_keyboard_item = 266;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_FIND: tm_input_keyboard_item = 267;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NUMPADCOMMA: tm_input_keyboard_item = 268;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_RO: tm_input_keyboard_item = 269;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_KATAKANAHIRAGANA: tm_input_keyboard_item =
    270;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_YEN: tm_input_keyboard_item = 271;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_HENKAN: tm_input_keyboard_item = 272;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_MUHENKAN: tm_input_keyboard_item = 273;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NUMPADJPCOMMA: tm_input_keyboard_item = 274;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_INTERNATIONAL_7: tm_input_keyboard_item =
    275;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_INTERNATIONAL_8: tm_input_keyboard_item =
    276;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_INTERNATIONAL_9: tm_input_keyboard_item =
    277;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_HANGEUL: tm_input_keyboard_item = 278;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_KATAKANA: tm_input_keyboard_item = 279;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_HIRAGANA: tm_input_keyboard_item = 280;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_ZENKAKUHANKAKU: tm_input_keyboard_item =
    281;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_LANG_6: tm_input_keyboard_item = 282;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_LANG_7: tm_input_keyboard_item = 283;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_LANG_8: tm_input_keyboard_item = 284;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_LANG_9: tm_input_keyboard_item = 285;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NUMPADLEFTPAREN: tm_input_keyboard_item =
    286;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_NUMPADRIGHTPAREN: tm_input_keyboard_item =
    287;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_LEFTMETA: tm_input_keyboard_item = 288;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_RIGHTMETA: tm_input_keyboard_item = 289;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_MEDIA_EJECT: tm_input_keyboard_item = 290;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_MEDIA_VOLUME_UP: tm_input_keyboard_item =
    291;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_MEDIA_VOLUME_DOWN: tm_input_keyboard_item =
    292;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_MEDIA_MUTE: tm_input_keyboard_item = 293;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_BROWSER_WWW: tm_input_keyboard_item = 294;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_BROWSER_SCROLLUP: tm_input_keyboard_item =
    295;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_BROWSER_SCROLLDOWN: tm_input_keyboard_item =
    296;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_BROWSER_EDIT: tm_input_keyboard_item = 297;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_BROWSER_SLEEP: tm_input_keyboard_item = 298;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_BROWSER_COFFEE: tm_input_keyboard_item =
    299;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_BROWSER_CALC: tm_input_keyboard_item = 300;
pub const tm_input_keyboard_item_TM_INPUT_KEYBOARD_ITEM_COUNT: tm_input_keyboard_item = 301;
pub type tm_input_keyboard_item = ::std::os::raw::c_int;
pub const tm_input_gamepad_item_TM_INPUT_GAMEPAD_ITEM_NONE: tm_input_gamepad_item = 0;
pub const tm_input_gamepad_item_TM_INPUT_GAMEPAD_ITEM_BUTTON_A: tm_input_gamepad_item = 1;
pub const tm_input_gamepad_item_TM_INPUT_GAMEPAD_ITEM_BUTTON_B: tm_input_gamepad_item = 2;
pub const tm_input_gamepad_item_TM_INPUT_GAMEPAD_ITEM_BUTTON_X: tm_input_gamepad_item = 3;
pub const tm_input_gamepad_item_TM_INPUT_GAMEPAD_ITEM_BUTTON_Y: tm_input_gamepad_item = 4;
pub const tm_input_gamepad_item_TM_INPUT_GAMEPAD_ITEM_BUTTON_LEFT_SHOULDER: tm_input_gamepad_item =
    5;
pub const tm_input_gamepad_item_TM_INPUT_GAMEPAD_ITEM_BUTTON_RIGHT_SHOULDER: tm_input_gamepad_item =
    6;
pub const tm_input_gamepad_item_TM_INPUT_GAMEPAD_ITEM_BUTTON_BACK: tm_input_gamepad_item = 7;
pub const tm_input_gamepad_item_TM_INPUT_GAMEPAD_ITEM_BUTTON_START: tm_input_gamepad_item = 8;
pub const tm_input_gamepad_item_TM_INPUT_GAMEPAD_ITEM_DPAD_LEFT: tm_input_gamepad_item = 9;
pub const tm_input_gamepad_item_TM_INPUT_GAMEPAD_ITEM_DPAD_RIGHT: tm_input_gamepad_item = 10;
pub const tm_input_gamepad_item_TM_INPUT_GAMEPAD_ITEM_DPAD_UP: tm_input_gamepad_item = 11;
pub const tm_input_gamepad_item_TM_INPUT_GAMEPAD_ITEM_DPAD_DOWN: tm_input_gamepad_item = 12;
pub const tm_input_gamepad_item_TM_INPUT_GAMEPAD_BUTTON_LEFT_THUMB: tm_input_gamepad_item = 13;
pub const tm_input_gamepad_item_TM_INPUT_GAMEPAD_BUTTON_RIGHT_THUMB: tm_input_gamepad_item = 14;
pub const tm_input_gamepad_item_TM_INPUT_GAMEPAD_ITEM_BUTTON_LEFT_TRIGGER: tm_input_gamepad_item =
    15;
pub const tm_input_gamepad_item_TM_INPUT_GAMEPAD_ITEM_BUTTON_RIGHT_TRIGGER: tm_input_gamepad_item =
    16;
pub const tm_input_gamepad_item_TM_INPUT_GAMEPAD_ITEM_LEFT_STICK: tm_input_gamepad_item = 17;
pub const tm_input_gamepad_item_TM_INPUT_GAMEPAD_ITEM_RIGHT_STICK: tm_input_gamepad_item = 18;
pub const tm_input_gamepad_item_TM_INPUT_GAMEPAD_ITEM_COUNT: tm_input_gamepad_item = 19;
pub type tm_input_gamepad_item = ::std::os::raw::c_int;
pub const tm_input_event_type_TM_INPUT_EVENT_TYPE_NONE: tm_input_event_type = 0;
pub const tm_input_event_type_TM_INPUT_EVENT_TYPE_DATA_CHANGE: tm_input_event_type = 1;
pub const tm_input_event_type_TM_INPUT_EVENT_TYPE_TEXT: tm_input_event_type = 2;
pub type tm_input_event_type = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_input_item_t {
    pub id: u64,
    pub name: *const ::std::os::raw::c_char,
    pub components: u32,
    pub _padding_412: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout_tm_input_item_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_input_item_t>(),
        24usize,
        concat!("Size of: ", stringify!(tm_input_item_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_input_item_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_input_item_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_input_item_t>())).id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_input_item_t),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_input_item_t>())).name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_input_item_t),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_input_item_t>())).components as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_input_item_t),
            "::",
            stringify!(components)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_input_item_t>()))._padding_412 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_input_item_t),
            "::",
            stringify!(_padding_412)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct tm_input_data_t {
    pub __bindgen_anon_1: tm_input_data_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union tm_input_data_t__bindgen_ty_1 {
    pub f: tm_vec4_t,
    pub codepoint: u32,
    _bindgen_union_align: [u32; 4usize],
}
#[test]
fn bindgen_test_layout_tm_input_data_t__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<tm_input_data_t__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(tm_input_data_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_input_data_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(tm_input_data_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_input_data_t__bindgen_ty_1>())).f as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_input_data_t__bindgen_ty_1),
            "::",
            stringify!(f)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_input_data_t__bindgen_ty_1>())).codepoint as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_input_data_t__bindgen_ty_1),
            "::",
            stringify!(codepoint)
        )
    );
}
#[test]
fn bindgen_test_layout_tm_input_data_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_input_data_t>(),
        16usize,
        concat!("Size of: ", stringify!(tm_input_data_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_input_data_t>(),
        4usize,
        concat!("Alignment of ", stringify!(tm_input_data_t))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct tm_input_event_t {
    pub time: u64,
    pub source: *mut tm_input_source_i,
    pub controller_id: u64,
    pub item_id: u64,
    pub type_: u64,
    pub data: tm_input_data_t,
    pub extra: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_tm_input_event_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_input_event_t>(),
        64usize,
        concat!("Size of: ", stringify!(tm_input_event_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_input_event_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_input_event_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_input_event_t>())).time as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_input_event_t),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_input_event_t>())).source as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_input_event_t),
            "::",
            stringify!(source)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_input_event_t>())).controller_id as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_input_event_t),
            "::",
            stringify!(controller_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_input_event_t>())).item_id as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_input_event_t),
            "::",
            stringify!(item_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_input_event_t>())).type_ as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_input_event_t),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_input_event_t>())).data as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_input_event_t),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_input_event_t>())).extra as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_input_event_t),
            "::",
            stringify!(extra)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_input_source_i {
    pub controller_name: *const ::std::os::raw::c_char,
    pub controller_type: u32,
    pub _padding_464: [::std::os::raw::c_char; 4usize],
    pub controllers: ::std::option::Option<unsafe extern "C" fn(ids: *mut *mut u64) -> u32>,
    pub items: ::std::option::Option<unsafe extern "C" fn(items: *mut *mut tm_input_item_t) -> u32>,
    pub events: ::std::option::Option<
        unsafe extern "C" fn(start: u64, events: *mut tm_input_event_t, buffer_size: u64) -> u64,
    >,
    pub state:
        ::std::option::Option<unsafe extern "C" fn(controller: u64, item: u64) -> tm_input_data_t>,
}
#[test]
fn bindgen_test_layout_tm_input_source_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_input_source_i>(),
        48usize,
        concat!("Size of: ", stringify!(tm_input_source_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_input_source_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_input_source_i))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_input_source_i>())).controller_name as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_input_source_i),
            "::",
            stringify!(controller_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_input_source_i>())).controller_type as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_input_source_i),
            "::",
            stringify!(controller_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_input_source_i>()))._padding_464 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_input_source_i),
            "::",
            stringify!(_padding_464)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_input_source_i>())).controllers as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_input_source_i),
            "::",
            stringify!(controllers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_input_source_i>())).items as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_input_source_i),
            "::",
            stringify!(items)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_input_source_i>())).events as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_input_source_i),
            "::",
            stringify!(events)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_input_source_i>())).state as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_input_source_i),
            "::",
            stringify!(state)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_input_api {
    pub add_source: ::std::option::Option<unsafe extern "C" fn(source: *mut tm_input_source_i)>,
    pub remove_source: ::std::option::Option<unsafe extern "C" fn(source: *mut tm_input_source_i)>,
    pub sources: ::std::option::Option<
        unsafe extern "C" fn(sources: *mut *mut *mut tm_input_source_i) -> u32,
    >,
    pub events: ::std::option::Option<
        unsafe extern "C" fn(start: u64, events: *mut tm_input_event_t, buffer_size: u64) -> u64,
    >,
    pub keyboard_item_names:
        ::std::option::Option<unsafe extern "C" fn() -> *mut *const ::std::os::raw::c_char>,
}
#[test]
fn bindgen_test_layout_tm_input_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_input_api>(),
        40usize,
        concat!("Size of: ", stringify!(tm_input_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_input_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_input_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_input_api>())).add_source as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_input_api),
            "::",
            stringify!(add_source)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_input_api>())).remove_source as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_input_api),
            "::",
            stringify!(remove_source)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_input_api>())).sources as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_input_api),
            "::",
            stringify!(sources)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_input_api>())).events as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_input_api),
            "::",
            stringify!(events)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_input_api>())).keyboard_item_names as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_input_api),
            "::",
            stringify!(keyboard_item_names)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_integration_test_runner_o {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_integration_test_runner_i {
    pub inst: *mut tm_integration_test_runner_o,
    pub context: u64,
    pub app: *mut tm_application_o,
    pub wait: ::std::option::Option<
        unsafe extern "C" fn(inst: *mut tm_integration_test_runner_o, sec: f32, id: u64) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_tm_integration_test_runner_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_integration_test_runner_i>(),
        32usize,
        concat!("Size of: ", stringify!(tm_integration_test_runner_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_integration_test_runner_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_integration_test_runner_i))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_integration_test_runner_i>())).inst as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_integration_test_runner_i),
            "::",
            stringify!(inst)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_integration_test_runner_i>())).context as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_integration_test_runner_i),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_integration_test_runner_i>())).app as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_integration_test_runner_i),
            "::",
            stringify!(app)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_integration_test_runner_i>())).wait as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_integration_test_runner_i),
            "::",
            stringify!(wait)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_integration_test_i {
    pub name: *const ::std::os::raw::c_char,
    pub context: u64,
    pub tick: ::std::option::Option<unsafe extern "C" fn(arg1: *mut tm_integration_test_runner_i)>,
}
#[test]
fn bindgen_test_layout_tm_integration_test_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_integration_test_i>(),
        24usize,
        concat!("Size of: ", stringify!(tm_integration_test_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_integration_test_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_integration_test_i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_integration_test_i>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_integration_test_i),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_integration_test_i>())).context as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_integration_test_i),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_integration_test_i>())).tick as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_integration_test_i),
            "::",
            stringify!(tick)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_atomic_counter_o {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_jobdecl_t {
    pub task: ::std::option::Option<unsafe extern "C" fn(data: *mut ::std::os::raw::c_void)>,
    pub data: *mut ::std::os::raw::c_void,
    pub pin_thread_handle: u32,
    pub _padding_20: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout_tm_jobdecl_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_jobdecl_t>(),
        24usize,
        concat!("Size of: ", stringify!(tm_jobdecl_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_jobdecl_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_jobdecl_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_jobdecl_t>())).task as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_jobdecl_t),
            "::",
            stringify!(task)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_jobdecl_t>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_jobdecl_t),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_jobdecl_t>())).pin_thread_handle as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_jobdecl_t),
            "::",
            stringify!(pin_thread_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_jobdecl_t>()))._padding_20 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_jobdecl_t),
            "::",
            stringify!(_padding_20)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_job_system_api {
    pub run_jobs: ::std::option::Option<
        unsafe extern "C" fn(jobs: *mut tm_jobdecl_t, num_jobs: u32) -> *mut tm_atomic_counter_o,
    >,
    pub run_jobs_and_auto_free_counter:
        ::std::option::Option<unsafe extern "C" fn(jobs: *mut tm_jobdecl_t, num_jobs: u32)>,
    pub wait_for_counter:
        ::std::option::Option<unsafe extern "C" fn(counter: *mut tm_atomic_counter_o, value: u32)>,
    pub wait_for_counter_and_free:
        ::std::option::Option<unsafe extern "C" fn(counter: *mut tm_atomic_counter_o)>,
    pub wait_for_counter_and_free_no_fiber:
        ::std::option::Option<unsafe extern "C" fn(counter: *mut tm_atomic_counter_o)>,
    pub pin_thread_handle:
        ::std::option::Option<unsafe extern "C" fn(worker_thread_idx: u32) -> u32>,
    pub num_worker_threads: ::std::option::Option<unsafe extern "C" fn() -> u32>,
}
#[test]
fn bindgen_test_layout_tm_job_system_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_job_system_api>(),
        56usize,
        concat!("Size of: ", stringify!(tm_job_system_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_job_system_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_job_system_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_job_system_api>())).run_jobs as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_job_system_api),
            "::",
            stringify!(run_jobs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_job_system_api>())).run_jobs_and_auto_free_counter as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_job_system_api),
            "::",
            stringify!(run_jobs_and_auto_free_counter)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_job_system_api>())).wait_for_counter as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_job_system_api),
            "::",
            stringify!(wait_for_counter)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_job_system_api>())).wait_for_counter_and_free as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_job_system_api),
            "::",
            stringify!(wait_for_counter_and_free)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_job_system_api>())).wait_for_counter_and_free_no_fiber
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_job_system_api),
            "::",
            stringify!(wait_for_counter_and_free_no_fiber)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_job_system_api>())).pin_thread_handle as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_job_system_api),
            "::",
            stringify!(pin_thread_handle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_job_system_api>())).num_worker_threads as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_job_system_api),
            "::",
            stringify!(num_worker_threads)
        )
    );
}
pub const tm_json_parse_ext_TM_JSON_PARSE_EXT_ALLOW_UNQUOTED_KEYS: tm_json_parse_ext = 1;
pub const tm_json_parse_ext_TM_JSON_PARSE_EXT_ALLOW_COMMENTS: tm_json_parse_ext = 2;
pub const tm_json_parse_ext_TM_JSON_PARSE_EXT_IMPLICIT_ROOT_OBJECT: tm_json_parse_ext = 4;
pub const tm_json_parse_ext_TM_JSON_PARSE_EXT_OPTIONAL_COMMAS: tm_json_parse_ext = 8;
pub const tm_json_parse_ext_TM_JSON_PARSE_EXT_EQUALS_FOR_COLON: tm_json_parse_ext = 16;
pub const tm_json_parse_ext_TM_JSON_PARSE_EXT_LUA_QUOTING: tm_json_parse_ext = 32;
pub type tm_json_parse_ext = ::std::os::raw::c_int;
pub const tm_json_generate_ext_TM_JSON_GENERATE_EXT_PREFER_UNQUOTED_KEYS: tm_json_generate_ext = 1;
pub const tm_json_generate_ext_TM_JSON_GENERATE_EXT_IMPLICIT_ROOT_OBJECT: tm_json_generate_ext = 4;
pub const tm_json_generate_ext_TM_JSON_GENERATE_EXT_NO_COMMAS: tm_json_generate_ext = 8;
pub const tm_json_generate_ext_TM_JSON_GENERATE_EXT_USE_EQUALS_INSTEAD_OF_COLON:
    tm_json_generate_ext = 16;
pub const tm_json_generate_ext_TM_JSON_GENERATE_EXT_USE_LUA_QUOTING: tm_json_generate_ext = 32;
pub const tm_json_generate_ext_TM_JSON_GENERATE_INLINE_SMALL_ARRAYS: tm_json_generate_ext = 64;
pub const tm_json_generate_ext_TM_JSON_GENERATE_INLINE_SMALL_OBJECTS: tm_json_generate_ext = 128;
pub const tm_json_generate_ext_TM_JSON_GENERATE_INDENT_WITH_TABS: tm_json_generate_ext = 256;
pub type tm_json_generate_ext = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_json_line_info_t {
    pub config_item: u32,
    pub line_number: u32,
}
#[test]
fn bindgen_test_layout_tm_json_line_info_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_json_line_info_t>(),
        8usize,
        concat!("Size of: ", stringify!(tm_json_line_info_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_json_line_info_t>(),
        4usize,
        concat!("Alignment of ", stringify!(tm_json_line_info_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_json_line_info_t>())).config_item as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_json_line_info_t),
            "::",
            stringify!(config_item)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_json_line_info_t>())).line_number as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_json_line_info_t),
            "::",
            stringify!(line_number)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct tm_json_parse_info_t {
    pub success: bool,
    pub error: [::std::os::raw::c_char; 80usize],
    pub _padding_97: [::std::os::raw::c_char; 3usize],
    pub num_line_info: u32,
    pub allocated_line_info: u32,
    pub line_info: [tm_json_line_info_t; 1usize],
}
#[test]
fn bindgen_test_layout_tm_json_parse_info_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_json_parse_info_t>(),
        100usize,
        concat!("Size of: ", stringify!(tm_json_parse_info_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_json_parse_info_t>(),
        4usize,
        concat!("Alignment of ", stringify!(tm_json_parse_info_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_json_parse_info_t>())).success as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_json_parse_info_t),
            "::",
            stringify!(success)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_json_parse_info_t>())).error as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_json_parse_info_t),
            "::",
            stringify!(error)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_json_parse_info_t>()))._padding_97 as *const _ as usize
        },
        81usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_json_parse_info_t),
            "::",
            stringify!(_padding_97)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_json_parse_info_t>())).num_line_info as *const _ as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_json_parse_info_t),
            "::",
            stringify!(num_line_info)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_json_parse_info_t>())).allocated_line_info as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_json_parse_info_t),
            "::",
            stringify!(allocated_line_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_json_parse_info_t>())).line_info as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_json_parse_info_t),
            "::",
            stringify!(line_info)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_json_generate_t {
    pub s: *mut ::std::os::raw::c_char,
    pub len: u32,
    pub allocated: u32,
}
#[test]
fn bindgen_test_layout_tm_json_generate_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_json_generate_t>(),
        16usize,
        concat!("Size of: ", stringify!(tm_json_generate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_json_generate_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_json_generate_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_json_generate_t>())).s as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_json_generate_t),
            "::",
            stringify!(s)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_json_generate_t>())).len as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_json_generate_t),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_json_generate_t>())).allocated as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_json_generate_t),
            "::",
            stringify!(allocated)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_json_api {
    pub parse: ::std::option::Option<
        unsafe extern "C" fn(
            s: *const ::std::os::raw::c_char,
            config: *mut tm_config_i,
            extensions: tm_json_parse_ext,
            error: *mut ::std::os::raw::c_char,
        ) -> bool,
    >,
    pub parse_with_line_info: ::std::option::Option<
        unsafe extern "C" fn(
            s: *const ::std::os::raw::c_char,
            config: *mut tm_config_i,
            extensions: tm_json_parse_ext,
            ta: *mut tm_temp_allocator_i,
        ) -> *mut tm_json_parse_info_t,
    >,
    pub line_number: ::std::option::Option<
        unsafe extern "C" fn(pi: *const tm_json_parse_info_t, item: *const tm_config_item_t) -> u32,
    >,
    pub generate: ::std::option::Option<
        unsafe extern "C" fn(
            config: *mut tm_config_i,
            flags: tm_json_generate_ext,
            ta: *mut tm_temp_allocator_i,
        ) -> tm_json_generate_t,
    >,
}
#[test]
fn bindgen_test_layout_tm_json_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_json_api>(),
        32usize,
        concat!("Size of: ", stringify!(tm_json_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_json_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_json_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_json_api>())).parse as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_json_api),
            "::",
            stringify!(parse)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_json_api>())).parse_with_line_info as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_json_api),
            "::",
            stringify!(parse_with_line_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_json_api>())).line_number as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_json_api),
            "::",
            stringify!(line_number)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_json_api>())).generate as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_json_api),
            "::",
            stringify!(generate)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_localizer_strings_t {
    pub num_strings: u32,
    pub stride_bytes: u32,
    pub strings: *const *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_tm_localizer_strings_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_localizer_strings_t>(),
        16usize,
        concat!("Size of: ", stringify!(tm_localizer_strings_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_localizer_strings_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_localizer_strings_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_localizer_strings_t>())).num_strings as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_localizer_strings_t),
            "::",
            stringify!(num_strings)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_localizer_strings_t>())).stride_bytes as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_localizer_strings_t),
            "::",
            stringify!(stride_bytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_localizer_strings_t>())).strings as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_localizer_strings_t),
            "::",
            stringify!(strings)
        )
    );
}
pub type tm_localizer_strings_i =
    ::std::option::Option<unsafe extern "C" fn(language: u64) -> tm_localizer_strings_t>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_localizer_o {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_localizer_i {
    pub inst: *mut tm_localizer_o,
    pub localize: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_localizer_o,
            s: *const ::std::os::raw::c_char,
            context: *const ::std::os::raw::c_char,
        ) -> *const ::std::os::raw::c_char,
    >,
}
#[test]
fn bindgen_test_layout_tm_localizer_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_localizer_i>(),
        16usize,
        concat!("Size of: ", stringify!(tm_localizer_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_localizer_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_localizer_i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_localizer_i>())).inst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_localizer_i),
            "::",
            stringify!(inst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_localizer_i>())).localize as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_localizer_i),
            "::",
            stringify!(localize)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_localizer_api {
    pub def: *mut *mut tm_localizer_i,
    pub passthrough: *mut tm_localizer_i,
}
#[test]
fn bindgen_test_layout_tm_localizer_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_localizer_api>(),
        16usize,
        concat!("Size of: ", stringify!(tm_localizer_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_localizer_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_localizer_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_localizer_api>())).def as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_localizer_api),
            "::",
            stringify!(def)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_localizer_api>())).passthrough as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_localizer_api),
            "::",
            stringify!(passthrough)
        )
    );
}
pub const tm_log_type_TM_LOG_TYPE_INFO: tm_log_type = 0;
pub const tm_log_type_TM_LOG_TYPE_DEBUG: tm_log_type = 1;
pub const tm_log_type_TM_LOG_TYPE_ERROR: tm_log_type = 2;
pub type tm_log_type = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_logger_o {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_logger_i {
    pub inst: *mut tm_logger_o,
    pub log: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_logger_o,
            log_type: tm_log_type,
            msg: *const ::std::os::raw::c_char,
        ),
    >,
}
#[test]
fn bindgen_test_layout_tm_logger_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_logger_i>(),
        16usize,
        concat!("Size of: ", stringify!(tm_logger_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_logger_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_logger_i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_logger_i>())).inst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_logger_i),
            "::",
            stringify!(inst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_logger_i>())).log as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_logger_i),
            "::",
            stringify!(log)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_logger_api {
    pub add_logger: ::std::option::Option<unsafe extern "C" fn(logger: *const tm_logger_i)>,
    pub remove_logger: ::std::option::Option<unsafe extern "C" fn(logger: *const tm_logger_i)>,
    pub print: ::std::option::Option<
        unsafe extern "C" fn(log_type: tm_log_type, msg: *const ::std::os::raw::c_char),
    >,
    pub printf: ::std::option::Option<
        unsafe extern "C" fn(
            log_type: tm_log_type,
            format: *const ::std::os::raw::c_char,
            ...
        ) -> ::std::os::raw::c_int,
    >,
    pub default_logger: *mut tm_logger_i,
}
#[test]
fn bindgen_test_layout_tm_logger_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_logger_api>(),
        40usize,
        concat!("Size of: ", stringify!(tm_logger_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_logger_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_logger_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_logger_api>())).add_logger as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_logger_api),
            "::",
            stringify!(add_logger)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_logger_api>())).remove_logger as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_logger_api),
            "::",
            stringify!(remove_logger)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_logger_api>())).print as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_logger_api),
            "::",
            stringify!(print)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_logger_api>())).printf as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_logger_api),
            "::",
            stringify!(printf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_logger_api>())).default_logger as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_logger_api),
            "::",
            stringify!(default_logger)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_lz4_api {
    pub compress: ::std::option::Option<
        unsafe extern "C" fn(
            src: *const ::std::os::raw::c_char,
            src_size: u32,
            dst: *mut ::std::os::raw::c_char,
            dst_capacity: u32,
        ) -> u32,
    >,
    pub decompress: ::std::option::Option<
        unsafe extern "C" fn(
            src: *const ::std::os::raw::c_char,
            src_size: u32,
            dst: *mut ::std::os::raw::c_char,
            dst_capacity: u32,
        ) -> u32,
    >,
    pub compress_bound: ::std::option::Option<unsafe extern "C" fn(src_size: u32) -> u32>,
}
#[test]
fn bindgen_test_layout_tm_lz4_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_lz4_api>(),
        24usize,
        concat!("Size of: ", stringify!(tm_lz4_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_lz4_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_lz4_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_lz4_api>())).compress as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_lz4_api),
            "::",
            stringify!(compress)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_lz4_api>())).decompress as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_lz4_api),
            "::",
            stringify!(decompress)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_lz4_api>())).compress_bound as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_lz4_api),
            "::",
            stringify!(compress_bound)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_math_api {
    pub mat44_multiply: ::std::option::Option<
        unsafe extern "C" fn(res: *mut tm_mat44_t, lhs: *const tm_mat44_t, rhs: *const tm_mat44_t),
    >,
    pub mat44_inverse:
        ::std::option::Option<unsafe extern "C" fn(res: *mut tm_mat44_t, m: *const tm_mat44_t)>,
    pub mat44_determinant: ::std::option::Option<unsafe extern "C" fn(m: *const tm_mat44_t) -> f32>,
    pub mat44_determinant33:
        ::std::option::Option<unsafe extern "C" fn(m: *const tm_mat44_t) -> f32>,
    pub mat44_to_quaternion:
        ::std::option::Option<unsafe extern "C" fn(m: *const tm_mat44_t) -> tm_vec4_t>,
    pub mat44_to_translation_quaternion_scale: ::std::option::Option<
        unsafe extern "C" fn(
            t: *mut tm_vec3_t,
            r: *mut tm_vec4_t,
            s: *mut tm_vec3_t,
            m: *const tm_mat44_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_tm_math_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_math_api>(),
        48usize,
        concat!("Size of: ", stringify!(tm_math_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_math_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_math_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_math_api>())).mat44_multiply as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_math_api),
            "::",
            stringify!(mat44_multiply)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_math_api>())).mat44_inverse as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_math_api),
            "::",
            stringify!(mat44_inverse)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_math_api>())).mat44_determinant as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_math_api),
            "::",
            stringify!(mat44_determinant)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_math_api>())).mat44_determinant33 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_math_api),
            "::",
            stringify!(mat44_determinant33)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_math_api>())).mat44_to_quaternion as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_math_api),
            "::",
            stringify!(mat44_to_quaternion)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_math_api>())).mat44_to_translation_quaternion_scale
                as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_math_api),
            "::",
            stringify!(mat44_to_translation_quaternion_scale)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_memory_tracker_scope_data_t {
    pub desc: *const ::std::os::raw::c_char,
    pub allocated_bytes: u64,
    pub allocation_count: u64,
    pub parent: u32,
    pub num_children: u32,
    pub tracing_enabled: bool,
    pub _padding_42: [::std::os::raw::c_char; 3usize],
    pub trace_count: u32,
}
#[test]
fn bindgen_test_layout_tm_memory_tracker_scope_data_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_memory_tracker_scope_data_t>(),
        40usize,
        concat!("Size of: ", stringify!(tm_memory_tracker_scope_data_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_memory_tracker_scope_data_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_memory_tracker_scope_data_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_memory_tracker_scope_data_t>())).desc as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_memory_tracker_scope_data_t),
            "::",
            stringify!(desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_memory_tracker_scope_data_t>())).allocated_bytes as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_memory_tracker_scope_data_t),
            "::",
            stringify!(allocated_bytes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_memory_tracker_scope_data_t>())).allocation_count as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_memory_tracker_scope_data_t),
            "::",
            stringify!(allocation_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_memory_tracker_scope_data_t>())).parent as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_memory_tracker_scope_data_t),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_memory_tracker_scope_data_t>())).num_children as *const _
                as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_memory_tracker_scope_data_t),
            "::",
            stringify!(num_children)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_memory_tracker_scope_data_t>())).tracing_enabled as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_memory_tracker_scope_data_t),
            "::",
            stringify!(tracing_enabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_memory_tracker_scope_data_t>()))._padding_42 as *const _
                as usize
        },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_memory_tracker_scope_data_t),
            "::",
            stringify!(_padding_42)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_memory_tracker_scope_data_t>())).trace_count as *const _
                as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_memory_tracker_scope_data_t),
            "::",
            stringify!(trace_count)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_memory_tracker_trace_data_t {
    pub file: *const ::std::os::raw::c_char,
    pub line: u32,
    pub scope: u32,
    pub allocated_bytes: u64,
    pub allocation_count: u64,
}
#[test]
fn bindgen_test_layout_tm_memory_tracker_trace_data_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_memory_tracker_trace_data_t>(),
        32usize,
        concat!("Size of: ", stringify!(tm_memory_tracker_trace_data_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_memory_tracker_trace_data_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_memory_tracker_trace_data_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_memory_tracker_trace_data_t>())).file as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_memory_tracker_trace_data_t),
            "::",
            stringify!(file)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_memory_tracker_trace_data_t>())).line as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_memory_tracker_trace_data_t),
            "::",
            stringify!(line)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_memory_tracker_trace_data_t>())).scope as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_memory_tracker_trace_data_t),
            "::",
            stringify!(scope)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_memory_tracker_trace_data_t>())).allocated_bytes as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_memory_tracker_trace_data_t),
            "::",
            stringify!(allocated_bytes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_memory_tracker_trace_data_t>())).allocation_count as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_memory_tracker_trace_data_t),
            "::",
            stringify!(allocation_count)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_memory_tracker_api {
    pub check_for_leaked_scopes: ::std::option::Option<unsafe extern "C" fn()>,
    pub create_scope: ::std::option::Option<
        unsafe extern "C" fn(desc: *const ::std::os::raw::c_char, parent_scope: u32) -> u32,
    >,
    pub destroy_scope: ::std::option::Option<unsafe extern "C" fn(s: u32)>,
    pub destroy_scope_allowing_leaks:
        ::std::option::Option<unsafe extern "C" fn(scope: u32, max_leaked_bytes: u64)>,
    pub record_realloc: ::std::option::Option<
        unsafe extern "C" fn(
            old_ptr: *mut ::std::os::raw::c_void,
            old_size: u64,
            new_ptr: *mut ::std::os::raw::c_void,
            new_size: u64,
            file: *const ::std::os::raw::c_char,
            line: u32,
            scope: u32,
        ),
    >,
    pub allocated_bytes: ::std::option::Option<unsafe extern "C" fn(scope: u32) -> u64>,
    pub allocation_count: ::std::option::Option<unsafe extern "C" fn(scope: u32) -> u64>,
    pub set_scope_tracing: ::std::option::Option<unsafe extern "C" fn(scope: u32, enabled: bool)>,
    pub scope_data_snapshot: ::std::option::Option<
        unsafe extern "C" fn(ta: *mut tm_temp_allocator_i) -> *mut tm_memory_tracker_scope_data_t,
    >,
    pub trace_data_snapshot: ::std::option::Option<
        unsafe extern "C" fn(ta: *mut tm_temp_allocator_i) -> *mut tm_memory_tracker_trace_data_t,
    >,
}
#[test]
fn bindgen_test_layout_tm_memory_tracker_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_memory_tracker_api>(),
        80usize,
        concat!("Size of: ", stringify!(tm_memory_tracker_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_memory_tracker_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_memory_tracker_api))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_memory_tracker_api>())).check_for_leaked_scopes as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_memory_tracker_api),
            "::",
            stringify!(check_for_leaked_scopes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_memory_tracker_api>())).create_scope as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_memory_tracker_api),
            "::",
            stringify!(create_scope)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_memory_tracker_api>())).destroy_scope as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_memory_tracker_api),
            "::",
            stringify!(destroy_scope)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_memory_tracker_api>())).destroy_scope_allowing_leaks
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_memory_tracker_api),
            "::",
            stringify!(destroy_scope_allowing_leaks)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_memory_tracker_api>())).record_realloc as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_memory_tracker_api),
            "::",
            stringify!(record_realloc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_memory_tracker_api>())).allocated_bytes as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_memory_tracker_api),
            "::",
            stringify!(allocated_bytes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_memory_tracker_api>())).allocation_count as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_memory_tracker_api),
            "::",
            stringify!(allocation_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_memory_tracker_api>())).set_scope_tracing as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_memory_tracker_api),
            "::",
            stringify!(set_scope_tracing)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_memory_tracker_api>())).scope_data_snapshot as *const _
                as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_memory_tracker_api),
            "::",
            stringify!(scope_data_snapshot)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_memory_tracker_api>())).trace_data_snapshot as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_memory_tracker_api),
            "::",
            stringify!(trace_data_snapshot)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_file_o {
    pub opaque: u64,
}
#[test]
fn bindgen_test_layout_tm_file_o() {
    assert_eq!(
        ::std::mem::size_of::<tm_file_o>(),
        8usize,
        concat!("Size of: ", stringify!(tm_file_o))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_file_o>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_file_o))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_file_o>())).opaque as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_file_o),
            "::",
            stringify!(opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_file_system_watcher_o {
    pub opaque: u64,
}
#[test]
fn bindgen_test_layout_tm_file_system_watcher_o() {
    assert_eq!(
        ::std::mem::size_of::<tm_file_system_watcher_o>(),
        8usize,
        concat!("Size of: ", stringify!(tm_file_system_watcher_o))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_file_system_watcher_o>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_file_system_watcher_o))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_file_system_watcher_o>())).opaque as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_file_system_watcher_o),
            "::",
            stringify!(opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_dll_o {
    pub opaque: u64,
}
#[test]
fn bindgen_test_layout_tm_dll_o() {
    assert_eq!(
        ::std::mem::size_of::<tm_dll_o>(),
        8usize,
        concat!("Size of: ", stringify!(tm_dll_o))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_dll_o>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_dll_o))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_dll_o>())).opaque as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_dll_o),
            "::",
            stringify!(opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_socket_o {
    pub opaque: u64,
}
#[test]
fn bindgen_test_layout_tm_socket_o() {
    assert_eq!(
        ::std::mem::size_of::<tm_socket_o>(),
        8usize,
        concat!("Size of: ", stringify!(tm_socket_o))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_socket_o>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_socket_o))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_socket_o>())).opaque as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_socket_o),
            "::",
            stringify!(opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_file_time_o {
    pub opaque: u64,
}
#[test]
fn bindgen_test_layout_tm_file_time_o() {
    assert_eq!(
        ::std::mem::size_of::<tm_file_time_o>(),
        8usize,
        concat!("Size of: ", stringify!(tm_file_time_o))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_file_time_o>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_file_time_o))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_file_time_o>())).opaque as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_file_time_o),
            "::",
            stringify!(opaque)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct tm_critical_section_o {
    pub opaque: [u8; 64usize],
}
#[test]
fn bindgen_test_layout_tm_critical_section_o() {
    assert_eq!(
        ::std::mem::size_of::<tm_critical_section_o>(),
        64usize,
        concat!("Size of: ", stringify!(tm_critical_section_o))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_critical_section_o>(),
        1usize,
        concat!("Alignment of ", stringify!(tm_critical_section_o))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_critical_section_o>())).opaque as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_critical_section_o),
            "::",
            stringify!(opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_semaphore_o {
    pub opaque: u64,
}
#[test]
fn bindgen_test_layout_tm_semaphore_o() {
    assert_eq!(
        ::std::mem::size_of::<tm_semaphore_o>(),
        8usize,
        concat!("Size of: ", stringify!(tm_semaphore_o))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_semaphore_o>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_semaphore_o))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_semaphore_o>())).opaque as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_semaphore_o),
            "::",
            stringify!(opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_thread_o {
    pub opaque: [u64; 2usize],
}
#[test]
fn bindgen_test_layout_tm_thread_o() {
    assert_eq!(
        ::std::mem::size_of::<tm_thread_o>(),
        16usize,
        concat!("Size of: ", stringify!(tm_thread_o))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_thread_o>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_thread_o))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_thread_o>())).opaque as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_thread_o),
            "::",
            stringify!(opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_fiber_o {
    pub opaque: u64,
}
#[test]
fn bindgen_test_layout_tm_fiber_o() {
    assert_eq!(
        ::std::mem::size_of::<tm_fiber_o>(),
        8usize,
        concat!("Size of: ", stringify!(tm_fiber_o))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_fiber_o>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_fiber_o))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_fiber_o>())).opaque as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_fiber_o),
            "::",
            stringify!(opaque)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct tm_socket_address_t {
    pub __bindgen_anon_1: tm_socket_address_t__bindgen_ty_1,
    pub port: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union tm_socket_address_t__bindgen_ty_1 {
    pub ip: u32,
    pub ip_byte: [u8; 4usize],
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_tm_socket_address_t__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<tm_socket_address_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(tm_socket_address_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_socket_address_t__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(tm_socket_address_t__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_socket_address_t__bindgen_ty_1>())).ip as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_socket_address_t__bindgen_ty_1),
            "::",
            stringify!(ip)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_socket_address_t__bindgen_ty_1>())).ip_byte as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_socket_address_t__bindgen_ty_1),
            "::",
            stringify!(ip_byte)
        )
    );
}
#[test]
fn bindgen_test_layout_tm_socket_address_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_socket_address_t>(),
        8usize,
        concat!("Size of: ", stringify!(tm_socket_address_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_socket_address_t>(),
        4usize,
        concat!("Alignment of ", stringify!(tm_socket_address_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_socket_address_t>())).port as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_socket_address_t),
            "::",
            stringify!(port)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_file_stat_t {
    pub exists: bool,
    pub is_directory: bool,
    pub _padding_106: [::std::os::raw::c_char; 6usize],
    pub last_modified_time: tm_file_time_o,
    pub size: u64,
}
#[test]
fn bindgen_test_layout_tm_file_stat_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_file_stat_t>(),
        24usize,
        concat!("Size of: ", stringify!(tm_file_stat_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_file_stat_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_file_stat_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_file_stat_t>())).exists as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_file_stat_t),
            "::",
            stringify!(exists)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_file_stat_t>())).is_directory as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_file_stat_t),
            "::",
            stringify!(is_directory)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_file_stat_t>()))._padding_106 as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_file_stat_t),
            "::",
            stringify!(_padding_106)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_file_stat_t>())).last_modified_time as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_file_stat_t),
            "::",
            stringify!(last_modified_time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_file_stat_t>())).size as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_file_stat_t),
            "::",
            stringify!(size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_strings_t {
    pub count: u32,
    pub bytes: u32,
}
#[test]
fn bindgen_test_layout_tm_strings_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_strings_t>(),
        8usize,
        concat!("Size of: ", stringify!(tm_strings_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_strings_t>(),
        4usize,
        concat!("Alignment of ", stringify!(tm_strings_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_strings_t>())).count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_strings_t),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_strings_t>())).bytes as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_strings_t),
            "::",
            stringify!(bytes)
        )
    );
}
pub type tm_thread_entry_f =
    ::std::option::Option<unsafe extern "C" fn(user_data: *mut ::std::os::raw::c_void)>;
pub type tm_fiber_entry_f =
    ::std::option::Option<unsafe extern "C" fn(user_data: *mut ::std::os::raw::c_void)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_os_virtual_memory_api {
    pub map: ::std::option::Option<unsafe extern "C" fn(size: u64) -> *mut ::std::os::raw::c_void>,
    pub unmap:
        ::std::option::Option<unsafe extern "C" fn(p: *mut ::std::os::raw::c_void, size: u64)>,
    pub reserve:
        ::std::option::Option<unsafe extern "C" fn(size: u64) -> *mut ::std::os::raw::c_void>,
    pub commit:
        ::std::option::Option<unsafe extern "C" fn(p: *mut ::std::os::raw::c_void, size: u64)>,
}
#[test]
fn bindgen_test_layout_tm_os_virtual_memory_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_os_virtual_memory_api>(),
        32usize,
        concat!("Size of: ", stringify!(tm_os_virtual_memory_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_os_virtual_memory_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_os_virtual_memory_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_os_virtual_memory_api>())).map as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_os_virtual_memory_api),
            "::",
            stringify!(map)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_os_virtual_memory_api>())).unmap as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_os_virtual_memory_api),
            "::",
            stringify!(unmap)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_os_virtual_memory_api>())).reserve as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_os_virtual_memory_api),
            "::",
            stringify!(reserve)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_os_virtual_memory_api>())).commit as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_os_virtual_memory_api),
            "::",
            stringify!(commit)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_os_file_io_api {
    pub open_input: ::std::option::Option<
        unsafe extern "C" fn(path: *const ::std::os::raw::c_char) -> tm_file_o,
    >,
    pub open_output: ::std::option::Option<
        unsafe extern "C" fn(path: *const ::std::os::raw::c_char, append: bool) -> tm_file_o,
    >,
    pub set_position: ::std::option::Option<unsafe extern "C" fn(file: tm_file_o, pos: u64)>,
    pub size: ::std::option::Option<unsafe extern "C" fn(file: tm_file_o) -> u64>,
    pub read: ::std::option::Option<
        unsafe extern "C" fn(
            file: tm_file_o,
            buffer: *mut ::std::os::raw::c_void,
            size: u64,
        ) -> i64,
    >,
    pub write: ::std::option::Option<
        unsafe extern "C" fn(
            file: tm_file_o,
            buffer: *const ::std::os::raw::c_void,
            size: u64,
        ) -> bool,
    >,
    pub read_at: ::std::option::Option<
        unsafe extern "C" fn(
            file: tm_file_o,
            offset: u64,
            buffer: *mut ::std::os::raw::c_void,
            size: u64,
        ) -> i64,
    >,
    pub write_at: ::std::option::Option<
        unsafe extern "C" fn(
            file: tm_file_o,
            offset: u64,
            buffer: *const ::std::os::raw::c_void,
            size: u64,
        ) -> bool,
    >,
    pub close: ::std::option::Option<unsafe extern "C" fn(file: tm_file_o)>,
    pub is_valid: ::std::option::Option<unsafe extern "C" fn(file: tm_file_o) -> bool>,
    pub invalid_file: tm_file_o,
}
#[test]
fn bindgen_test_layout_tm_os_file_io_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_os_file_io_api>(),
        88usize,
        concat!("Size of: ", stringify!(tm_os_file_io_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_os_file_io_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_os_file_io_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_os_file_io_api>())).open_input as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_os_file_io_api),
            "::",
            stringify!(open_input)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_os_file_io_api>())).open_output as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_os_file_io_api),
            "::",
            stringify!(open_output)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_os_file_io_api>())).set_position as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_os_file_io_api),
            "::",
            stringify!(set_position)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_os_file_io_api>())).size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_os_file_io_api),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_os_file_io_api>())).read as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_os_file_io_api),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_os_file_io_api>())).write as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_os_file_io_api),
            "::",
            stringify!(write)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_os_file_io_api>())).read_at as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_os_file_io_api),
            "::",
            stringify!(read_at)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_os_file_io_api>())).write_at as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_os_file_io_api),
            "::",
            stringify!(write_at)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_os_file_io_api>())).close as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_os_file_io_api),
            "::",
            stringify!(close)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_os_file_io_api>())).is_valid as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_os_file_io_api),
            "::",
            stringify!(is_valid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_os_file_io_api>())).invalid_file as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_os_file_io_api),
            "::",
            stringify!(invalid_file)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_os_file_system_api {
    pub stat: ::std::option::Option<
        unsafe extern "C" fn(path: *const ::std::os::raw::c_char) -> tm_file_stat_t,
    >,
    pub directory_entries: ::std::option::Option<
        unsafe extern "C" fn(
            path: *const ::std::os::raw::c_char,
            ta: *mut tm_temp_allocator_i,
        ) -> *mut tm_strings_t,
    >,
    pub make_directory:
        ::std::option::Option<unsafe extern "C" fn(path: *const ::std::os::raw::c_char) -> bool>,
    pub remove_file:
        ::std::option::Option<unsafe extern "C" fn(path: *const ::std::os::raw::c_char) -> bool>,
    pub remove_directory:
        ::std::option::Option<unsafe extern "C" fn(path: *const ::std::os::raw::c_char) -> bool>,
    pub rename: ::std::option::Option<
        unsafe extern "C" fn(
            old_name: *const ::std::os::raw::c_char,
            new_name: *const ::std::os::raw::c_char,
        ) -> bool,
    >,
    pub copy_file: ::std::option::Option<
        unsafe extern "C" fn(
            from: *const ::std::os::raw::c_char,
            to: *const ::std::os::raw::c_char,
        ) -> bool,
    >,
    pub getcwd: ::std::option::Option<
        unsafe extern "C" fn(ta: *mut tm_temp_allocator_i) -> *const ::std::os::raw::c_char,
    >,
    pub chdir:
